.emacs.d/init.org
#+TITLE: GNU Emacs Config
#+AUTHOR: Peter Hofmann
#+DESCRIPTION: Peter’s personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+PROPERTY: header-args:elisp :lexical t :tangle yes :session elisp-session

(not sure what the ~:session~ property above actually does)

Use ~org-babel-tangle~ to generate =init.el= and reload config.
# Use ~org-babel-load-file~ to reload config.

Debugging-related things:
#+begin_src elisp
;; For debugging:
(setq debug-on-error t)
;; If packages are not getting installed, it may be due to outdated package
;; descriptions. Refresh them with this command:
;; (package-refresh-contents)
#+end_src

* IMPORTANT PROGRAMS TO LOAD FIRST
** Use lexical bindings
By default, Emacs Lisp uses dynamic bindings, which is slower and outdated.
#+begin_src elisp
;;; -*- lexical-binding: t; -*-
#+end_src

** Custom File

#+begin_src elisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src
** Package Manager

#+begin_src elisp
(setq package-native-compile t)

(setq package-archives 
      '(("melpa" . "https://melpa.org/packages/")
        ("elpa" . "https://elpa.gnu.org/packages/")
	("elpa-devel" . "https://elpa.gnu.org/devel/")))

;; Bootstrap use-package:
;; (package-initialize)                ; ? still needed
;; (setq use-package-always-pin "nongnu") ; ? is this important
;; (setq use-package-always-ensure t)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-when-compile (require 'use-package)) ; ? needed
#+end_src

*vc-package integration into use-package*
- *NOTE:* remove after upgrade to /Emacs 30/, since it’s built-in there
#+begin_src elisp
(unless (package-installed-p 'vc-use-package)
  (package-vc-install "https://github.com/slotThe/vc-use-package"))
#+end_src

*use-package autoremove fix*

Custom ~package-autoremove~ that only removes packages not ~:ensure~'d in
~use-package~ declarations by building a custom list that overrides
~package-selected-packages~.

Normally, ~use-package~ should add (via ~:ensure~) auto-installed packages to
~package-selected-packages~, but it seems like they are added only as
dependencies, which causes ~package-autoremove~ to remove them, hence the fix.
- may be fixed properly in the future (hopefully?), then this snippet can be
  removed
- [[https://github.com/jwiegley/use-package/issues/870#issuecomment-771881305][Source]] (GitHub)
#+begin_src elisp
(defvar use-package-selected-packages '(use-package)
  "Packages pulled in by use-package.")
(defun use-package-autoremove ()
  "Autoremove packages not used by use-package."
  (interactive)
  (let ((package-selected-packages use-package-selected-packages))
    (package-autoremove)))

(eval-and-compile
  (define-advice use-package-handler/:ensure (:around (fn name-symbol keyword args rest state) select)
    (let ((items (funcall fn name-symbol keyword args rest state)))
      (dolist (ensure args items)
        (let ((package
	       (or (and (eq ensure t) (use-package-as-symbol name-symbol))
                   ensure)))
          (when package
            (when (consp package)
	      (setq package (car package)))
            (push `(add-to-list 'use-package-selected-packages ',package) items))))))
  (define-advice use-package-handler/:vc (:around (fn name-symbol keyword args rest state) select)
    (let ((items (funcall fn name-symbol keyword args rest state)))
      (dolist (ensure args items)
        (let ((package
	       (or (and (eq ensure t) (use-package-as-symbol name-symbol))
                   ensure)))
          (when package
            (when (consp package)
	      (setq package (car package)))
            (push `(add-to-list 'use-package-selected-packages ',package) items)))))) 
  (define-advice use-package-handler/:quelpa (:around (fn name-symbol keyword args rest state) select)
    (let ((package (pcase (car args)
                     ((pred symbolp) (car args))
                     ((pred listp) (car (car args))))))
      (cons `(add-to-list 'use-package-selected-packages ',package)
            (funcall fn name-symbol keyword args rest state)))))
#+end_src

** Includes

#+begin_src elisp
(require 'org-tempo)
;; (require 'eldoc)
#+end_src

* Personal information
#+begin_src elisp
(setq user-full-name "Peter Hofmann"
      user-mail-address "peter.hofmann@formsandlines.eu")
#+end_src

* Basic config
#+begin_src elisp
;; There are some warnings I really can’t do anything about and they
;; are annoying, so keep quiet
(setq warning-minimum-level :emergency)

;; Display relative line numbers
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode 1)
(setq display-line-numbers-widen t)
(setq display-line-numbers-width-start t)
(setq display-line-numbers-width 3)

;; Display column number in modeline
(column-number-mode 1)

;; Highlight current line
(global-hl-line-mode 1)

;; Disable tab insertion for indentation
(setq indent-tabs-mode nil)

;; Set max char count for automatic line breaks
(setq-default fill-column 80) ; ! FIXME: still 70?
;; Display vertical line at char limit
(global-display-fill-column-indicator-mode 1)
(setq display-fill-column-indicator-character 9474)

(setq repeat-mode t)
(setq repeat-exit-key "<return>")

(setq sentence-end-double-space nil)

(setq next-screen-context-lines 4) ;; was 2

(setq blink-cursor-mode nil)

;; Remember and get back to recently opened files
(recentf-mode 1)

;; Remember and restore the last cursor location of opened files
(save-place-mode 1)
;; Save and restore the state of Emacs from one session to another
(if (display-graphic-p)
    (desktop-save-mode 1)
  ;; prevent saving/restoring the desktop in terminal mode
  (desktop-save-mode 0))

;; Don’t pop up UI dialogs when prompting
(setq use-dialog-box nil)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)
;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Disabled by default, but I find them useful and not confusing:
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

;; No backup files (foo.txt~):
(setq make-backup-files nil)

;; Follow symlinks for version control:
(setq vc-follow-symlinks t)

;; Can just type C-SPC without C-u to pop the mark multiple times:
(setq set-mark-command-repeat-pop t)

;; Record state of window configuration to undo/redo:
;; - C-c <left> to undo window configuration
;; - C-c <right> to redo
(winner-mode 1)

;; Enable commands to move windows:
(windmove-mode 1)

;; Enable tabs
(tab-bar-mode 1)

(setq initial-major-mode 'lisp-interaction-mode)

;; (defvar ph/bib-files "~/Documents/Org-roam/bibliography/master-lib.bib")

;; Placeholder variable to be reset in themes
(defvar ph/cursor-bg "#0000ff")
#+end_src

* General fixes
#+begin_src elisp
;; work-around  for org-ctags obnoxious behavior
(with-eval-after-load 'org-ctags (setq org-open-link-functions nil))

#+end_src
