.emacs.d/init.org
* GUI tweaks
#+begin_src elisp
(setq inhibit-startup-message t)

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; e.g. to show the `λ' symbol when typing `lambda'
(global-prettify-symbols-mode 1)

;; macOS titlebar decoration
;; - see https://xenodium.com/my-emacs-eye-candy/
;; - doesn’t seem to work (no such variables?)
;; (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
;; (add-to-list 'default-frame-alist '(ns-appearance . dark))

;; better mouse wheel scrolling
;; https://stackoverflow.com/a/26053341
(setq mouse-wheel-scroll-amount '(0.07))
;; https://stackoverflow.com/a/445881
(setq mouse-wheel-progressive-speed nil)

;; Make Emacs Calculator window larger:
(setq calc-window-height 20)

;; Frame height has to be adjusted exactly, because Calculator window reacts
;; very sensitively to font size and line height, otherwise the trail cursor
;; will not follow new entries (window bottom MUST end after a full line). It
;; seems like this only works with pixel values instead of line count, but if
;; font/face settings have been changed, I must determine a new frame height.
;; (defvar ph/my-frame-1x-width 87)
(defvar ph/my-frame-1x-width-px 700)
;; (defvar ph/my-frame-2x-width 176)
(defvar ph/my-frame-2x-width-px 1400)
;; (defvar ph/my-frame-2x+sidebar-width 176) ;; TODO: adjust
(defvar ph/my-frame-2x+sidebar-width-px 1700)

;; (defvar ph/my-frame-lg-height 90) ;; lg -> my external 27" LG monitor
(defvar ph/my-frame-lg-height-px 1367)
;; (defvar ph/my-frame-mb-height 70) ;; mb -> my macbook 16" monitor
(defvar ph/my-frame-mb-height-px 1007)

(defun ph/set-frame-size-balance (w h &optional pixelwise)
  (set-frame-size nil w h pixelwise)
  (balance-windows))

(defun ph/select-rightmost-window ()
  "Select the rightmost window"
  (interactive)
  (while (ignore-errors (windmove-right) t)))

;; ! will fix BUFFER, so balancing doesn’t work if > 1 window has that buffer
;; needs a different solution or a temporary buffer to fix
(defun ph/my-set-frame-2x+sidebar (height)
  (set-frame-size
   nil
   ph/my-frame-2x+sidebar-width-px
   ph/my-frame-mb-height-px
   t))

;; (defun ph/my-set-frame-2x+sidebar (height)
;;   (set-frame-size
;;    nil
;;    ph/my-frame-2x+sidebar-width-px
;;    ph/my-frame-mb-height-px
;;    t)
;;   (ph/select-rightmost-window)
;;   (let* ((sidebar-window (selected-window))
;; 	 (sidebar-width-px (- ph/my-frame-2x+sidebar-width-px
;; 			      ph/my-frame-2x-width-px))
;; 	 (delta (- sidebar-width-px
;; 		   (window-size sidebar-window t t))))
;;     (when (window-size-fixed-p sidebar-window t)
;;       (setq window-size-fixed nil))
;;     (window-resize sidebar-window delta t nil t)
;;     (setq window-size-fixed 'width)
;;     (balance-windows)
;;     ;; (setq window-size-fixed nil)
;;     ))


(defun ph/my-set-frame-lg-1x ()
  (interactive)
  (ph/set-frame-size-balance
   ph/my-frame-1x-width-px
   ph/my-frame-lg-height-px
   t))

(defun ph/my-set-frame-lg-2x ()
  (interactive)
  (ph/set-frame-size-balance
   ph/my-frame-2x-width-px
   ph/my-frame-lg-height-px
   t))

(defun ph/my-set-frame-lg-2x+sidebar ()
  (interactive)
  (ph/my-set-frame-2x+sidebar ph/my-frame-lg-height-px))

(defun ph/my-set-frame-mb-1x ()
  (interactive)
  (ph/set-frame-size-balance
   ph/my-frame-1x-width-px
   ph/my-frame-mb-height-px
   t))

(defun ph/my-set-frame-mb-2x ()
  (interactive)
  (ph/set-frame-size-balance
   ph/my-frame-2x-width-px
   ph/my-frame-mb-height-px
   t))

(defun ph/my-set-frame-mb-2x+sidebar ()
  (interactive)
  (ph/my-set-frame-2x+sidebar ph/my-frame-mb-height-px))

;; (defun ph/set-frame-size-1x-mb ()
;;   (interactive)
;;   (ph/set-frame-size-balance ph/my-frame-))

;; (keymap-global-set "C-c d d" #'ph/set-frame-size-lg)
;; (keymap-global-set "C-c d D" #'ph/set-frame-size-mb)

#+end_src

** COMMENT Pixel scrolling
#+begin_src elisp

(pixel-scroll-precision-mode 1)

(setq pixel-scroll-precision-use-momentum t)
;; I’m just making blind guesses here, no idea what these values mean:
(setq pixel-scroll-precision-initial-velocity-factor 0.001) ;; def. 0.008375
(setq pixel-scroll-precision-interpolation-between-scroll 0.0001) ;; def. 0.001
(setq pixel-scroll-precision-interpolation-factor 1.2) ;; def. 2.0
(setq pixel-scroll-precision-momentum-min-velocity 10.0) ;; default 10.0

#+end_src

* isearch
#+begin_src elisp
;; Remove “pause” when changing directions
(setq isearch-repeat-on-direction-change t)
;; Do not wrap isearch when reaching the end of a buffer
(setq isearch-wrap-pause nil)
;; Max length of search ring (default: 16)
;; - cycle using `M-p' and `M-n'
(setq search-ring-max 4)
;; Do not allow scrolling commands to exit search
(setq isearch-allow-scroll t)

;; (setq isearch-forward-thing-at-point '(region url symbol sexp))

(keymap-set Info-mode-map "M-{" #'Info-search-backward)
(keymap-set Info-mode-map "M-}" #'Info-search-next)

;; `C-M-d' triggers dictionary on MacOS, so `isearch-del-char` needs to be
;; rebound. Also, it is incredibly annoying that `DEL' also returns to the
;; previous search item, so:
(keymap-set isearch-mode-map "DEL" #'isearch-del-char)
(keymap-set isearch-mode-map "C-p" #'isearch-delete-char)
;; `M-s M-<' and `M-s M->' are just too annoying to type, so:
(keymap-set isearch-mode-map "C->" #'isearch-end-of-buffer)
(keymap-set isearch-mode-map "C-<" #'isearch-beginning-of-buffer)


#+end_src
* Packages
** use-package add-ons
*** diminish
Enable ~:diminish~ to hide modeline display of some minor modes:
#+begin_src elisp
(use-package diminish
  :ensure t)
#+end_src
*** vc-use-package
To prevent ~use-package-autoremove~ from deleting it.
#+begin_src elisp
(use-package vc-use-package
  :ensure t) 
#+end_src
** Keybinding helper
*** which-key
#+begin_src elisp
(use-package which-key
  :ensure t
  :init
  (which-key-mode 1)
  :config
  ;; (setq which-key-side-window-location 'bottom)
  ;; (setq which-key-sort-order #'which-key-key-order-alpha)
  ;; (setq which-key-sort-uppercase-first nil)
  ;; (setq which-key-add-column-padding 1)
  ;; (setq which-key-max-display-columns nil)
  ;; (setq which-key-min-display-lines 6)
  ;; (setq which-key-side-window-slot -10)
  ;; (setq which-key-side-window-max-height 0.25)
  ;; (setq which-key-idle-delay 0.8)
  ;; (setq which-key-max-description-length 25)
  ;; (setq which-key-allow-imprecise-window-fit t)
  ;; (setq which-key-separator " → ")
  )
#+end_src

