.emacs.d/init.org
*** hydra
#+begin_src elisp
(use-package hydra
  :ensure t
  :diminish
  :config
  (defhydra hydra-zoom ()
    "zoom"
    ("g" text-scale-increase "in")
    ("l" text-scale-decrease "out")
    
    ("SPC" nil "cancel"))

  (defhydra hydra-view ()
    "view"
    ;; command names strangely reversed
    ("j" ph/scroll-one-line-up "down")
    ("k" ph/scroll-one-line-down "up")
    ("v" ph/scroll-up-half "half pg down")
    ("V" ph/scroll-down-half "half pg up")
    ("d" scroll-up-command "page down")
    ("u" scroll-down-command "page up")
    
    ("J" end-of-buffer "buffer end")
    ("K" beginning-of-buffer "buffer start")

    ("c" recenter "view center")
    ("t" (lambda () (interactive) (recenter 0)) "view top")
    ("b" (lambda () (interactive) (recenter -1)) "view bottom") ;; doesn’t work
    
    ("?" (hydra-set-property 'hydra-view :verbosity 1) :exit nil)
    ("SPC" nil "cancel"))
  ;; wrapper to hide minibuffer help since it makes movement bouncy
  (defun hydra-view-silent ()
    (interactive)
    (hydra-set-property 'hydra-view :verbosity 0)
    (hydra-view/body))

  (defhydra hydra-org (:color pink)
    "Org Mode movement"
    ;; command names strangely reversed
    ("k" org-previous-visible-heading "prev heading")
    ("K" org-backward-heading-same-level "backward heading")
    ("J" org-forward-heading-same-level "forward heading")
    ("j" org-next-visible-heading "next heading")
    
    ("u" outline-up-heading "up heading")
    ("o" org-cycle "cycle headings")
    ("c" org-shifttab "cycle all")
    ("a" org-fold-show-all "show all")
    ("s" org-kill-note-or-show-branches "unfold subtree")

    ("H" org-previous-item "prev item")
    ("h" org-backward-element "backward element")
    ("l" org-forward-element "forward element")
    ("L" org-next-item "next item")

    ("f" org-narrow-to-subtree "focus subtree")
    ("d" widen "defocus subtree")

    ("?" (hydra-set-property 'hydra-org :verbosity 1) :exit nil)
    ("SPC" nil "cancel"))
  ;; wrapper to hide minibuffer help since it makes movement bouncy
  (defun hydra-org-silent ()
    (interactive)
    (hydra-set-property 'hydra-org :verbosity 0)
    (hydra-org/body))

  (defhydra hydra-window ()
    "window"
    ;; Window buffer
    ("b" switch-to-buffer)
    ("f" find-file)
    ;; Window commands
    ("c" delete-window)        ;; C-x 0
    ("d" delete-other-windows :color blue) ;; C-x 1
    ("s" split-window-below)   ;; C-x 2
    ("v" split-window-right)   ;; C-x 3
    ("w" other-window)	  ;; C-x o
    ("=" balance-windows)
    ;; Move to windows, keeping hydra open
    ("h" windmove-left :color blue)
    ("j" windmove-down :color blue)
    ("k" windmove-up :color blue)
    ("l" windmove-right :color blue)
    ;; Move to windows
    ("H" windmove-left)
    ("J" windmove-down)
    ("K" windmove-up)
    ("L" windmove-right)
    ;; Move windows
    ("C-h" ph/buf-move-left)
    ("C-j" ph/buf-move-down)
    ("C-k" ph/buf-move-up)
    ("C-l" ph/buf-move-right)
    ;; Rotate windows/layout
    ("r" rotate-window)
    ("R" rotate-layout)
    ;; Resize windows
    ("C-M-h" shrink-window-horizontally)
    ("C-M-l" enlarge-window-horizontally)
    ("C-M-k" enlarge-window)
    ("C-M-j" shrink-window)
    ;; Resize frame
    ("[" ph/my-set-frame-lg-1x :color blue)
    ("]" ph/my-set-frame-lg-2x :color blue)
    ("{" ph/my-set-frame-mb-1x :color blue)
    ("}" ph/my-set-frame-mb-2x :color blue)
    ;; Undo/Redo window configuration
    ("u" winner-undo)
    ("o" winner-redo)

    ("?" (hydra-set-property 'hydra-window :verbosity 1) :exit nil)
    ("SPC" nil "cancel"))
  ;; wrapper to hide minibuffer help since it makes movement bouncy
  (defun hydra-window-silent ()
    (interactive)
    (hydra-set-property 'hydra-window :verbosity 0)
    (hydra-window/body))

 
  ;;; Hydras for meow table-mode

  (defun ph/org-table-insert-row-below ()
    "Like org-table-insert-row, but inserts below the current line."
    (interactive)
    ;; Universal argument reverses the direction of insertion:
    (org-table-insert-row '(4)))

  (defun ph/org-table-insert-column-right ()
    "Like org-table-insert-column, but inserts to the right instead."
    (interactive)
    (org-table-insert-column)
    (org-table-move-column))
  
  (defhydra hydra-table-insert (:color blue)
    "insert table row/column"
    ("k" org-table-insert-row)
    ("j" ph/org-table-insert-row-below)
    ("h" org-table-insert-column)
    ("l" ph/org-table-insert-column-right)
    
    ("SPC" nil "cancel"))

  (defhydra hydra-table-move ()
    "insert table row/column"
    ("k" org-table-move-row-up)
    ("j" org-table-move-row-down)
    ("h" org-table-move-column-left)
    ("l" org-table-move-column-right)
    
    ("K" org-table-move-cell-up)
    ("J" org-table-move-cell-down)
    ("H" org-table-move-cell-left)
    ("L" org-table-move-cell-right)
    
    ("t" nil "cancel")
    ("SPC" nil "cancel"))
  
  )
#+end_src
*** meow/
