.emacs.d/init.el

;; Let 'a' in 'normal' mode behave like 'a' in Vi:
;; - https://github.com/meow-edit/meow/discussions/497#discussioncomment-6713192
;; - unused for now, since it somehow doesn’t work with my clj-refactor
;;   hook to disable 'cljr-slash'
(defun ph/meow-append ()
  "Move to the end of selection, switch to INSERT state."
  (interactive)
  (if meow--temp-normal
      (progn
        (message "Quit temporary normal mode")
        (meow--switch-state 'motion))
    (if (not (region-active-p))
        (when (and (not (use-region-p))
                   (< (point) (point-max)))
          (forward-char 1))
      (meow--direction-forward)
      (meow--cancel-selection))
    (meow--switch-state 'insert)))

(defun ph/meow-line-append ()
  "Appends to the end of the current line."
  (interactive)
  (meow-end-of-thing (meow-line 1))
  (meow-append))

(defun ph/meow-line-insert ()
  "Inserts at the beginning (indentation) of the current line."
  (interactive)
  (meow-beginning-of-thing (meow-line 1))
  (meow-insert))

(defun ph/meow-join-with ()
  "Joins current line with line below."
  (interactive)
  (meow-join -1)
  (meow-kill))

(defun ph/meow-split-at ()
  "Splits current line at point."
  (interactive)
  (electric-newline-and-maybe-indent))

;; (defun ph/meow-search-backwards ()
;;   "Searches backwards."
;;   (interactive)
;;   (meow-search (negative-argument -1)))

(defun ph/meow-insert-exit ()
  "Switch to previous state."
  (interactive)
  (cond
   ((meow-keypad-mode-p)
    (meow--exit-keypad-state))
   ((and (meow-insert-mode-p)
         (eq meow--beacon-defining-kbd-macro 'quick))
    (setq meow--beacon-defining-kbd-macro nil)
    (meow-beacon-insert-exit))
   ((meow-insert-mode-p)
    (when overwrite-mode
      (overwrite-mode -1))
    (meow--switch-state 'normal))))

(defun ph/meow-eval-buffer (&optional buffer undef-all)
  "Conditionally evokes eval-buffer commands specific to the active
major mode or the general command if none applies."
  (interactive (list (current-buffer) (equal current-prefix-arg '(4))))
  (cond
   ((eq major-mode 'clojure-mode)
    (cider-eval-buffer buffer nil undef-all))
   ((eq major-mode 'janet-ts-mode)
    (ajrepl-send-buffer))
   (t (eval-buffer buffer))))

(defun ph/meow-eval-region (start end)
  "Conditionally evokes eval-region commands specific to the active
major mode or the general command if none applies."
  (interactive "r")
  (cond
   ((eq major-mode 'janet-ts-mode)
    (ajrepl-send-region start end))
   ((t (eval-region start end)))))

(defun ph/meow-eval-dwim (&optional start end)
  "Calls `ph/meow-eval-region' if a region is active, otherwise
calls `meow-eval-last-exp'."
  (interactive "r")
  (if (region-active-p)
      (ph/meow-eval-region start end)
    (meow-eval-last-exp)))

(defun ph/meow-change-save ()
  "Calls `meow-change-save' if a region is active, otherwise calls
`meow-change'."
  (interactive)
  (if (region-active-p)
      (meow-change-save)
    (meow-change)))

(defun ph/meow-search-reverse ()
  "Reverses the search direction from `meow-search' (like `-n')."
  (interactive)
  (meow-search -1))

;; prefix /
(defconst ph/meow-prefix-slash
  (list
   ;;; COMMENTS
   '("//" . meow-comment)		; nf -> nc -> /g
   
   ;;; MACROS
   '("/M" . meow-start-kmacro-or-insert-counter)
   '("/m" . meow-start-kmacro)
   '("/n" . meow-end-or-call-kmacro)
   
   ;;; REFERENCES
   '("/f" . xref-find-definitions)
   '("/F" . xref-go-back)
   '("/r" . xref-find-references)
   '("/a" . xref-find-apropos)
   '("/j" . eldoc)
   '("/R" . eglot-rename)

   ;;; SYSTEM CLIPBOARD
   '("/cc" . meow-clipboard-save)
   '("/cx" . meow-clipboard-kill)
   '("/cv" . meow-clipboard-yank)

   ;;; WORDS
   '("/lu" . upcase-dwim)
   '("/ll" . downcase-dwim)
   '("/lc" . capitalize-dwim)
   
   ;;; NUMBERS
   '("/+" . ph/increment-number-at-point)
   '("/-" . ph/decrement-number-at-point)

   ;;; WRAPPING
   '("/ww" . ph/wrap-with-char)
   '("/wc" . ph/change-wrapped-char)
   '("/wd" . ph/remove-surrounding)

   ;;; INDENTATION
   '("/ TAB" . org-indent-item)  ; org-mode replaces <tab>
   '("/ <backtab>" . org-outdent-item)  ; org-mode replaces <backtab>

   ;;; SPECIAL CHARS
   '("/ SPC" . (lambda () (interactive) (insert-char ?\s)))  

   ;;; GOTO 
   '("/ge" . end-of-buffer)
   '("/G" . end-of-buffer)
   '("/gj" . end-of-buffer)
   '("/gk" . beginning-of-buffer)
   '("/gg" . beginning-of-buffer)	;
   '("/gl" . meow-goto-line)
   '("/gc" . move-to-column)
   '("/gp" . goto-char)

   ;;; SEARCH
   '("/v" . meow-visit)	        ; / -> ? -> / -> ns -> /s -> /v
   '("/s" . isearch-forward-thing-at-point)

   ;;; EVAL
   '("/e" . ph/meow-eval-dwim)  ; just C-x C-e or ph/meow-eval-region
   '("/b" . ph/meow-eval-buffer)
   ;; '("/r" . ph/meow-eval-region)
   '("/d" . "C-M-x")  ; = eval-defun & friends

   ;; CITATION
   ;; '("/'" . org-cite-insert)  ; not helpful when in insert-mode
   ;; '("/\"" . org-cite-insert)
   
   ;; '("/j" . ph/meow-join-with)
   ;; '("/k" . ph/meow-split-at)
   
   ;; '("/c" . kill-ring-save)
   ;; '("/p" . yank)
   ))

;; prefix ; -> \
(defconst ph/meow-prefix-backslash
  (list
   ;; BUFFER
   '("\\\\" . switch-to-buffer)
   '("\\|" . ibuffer)
   '("\\q" . meow-quit)
   '("\\w" . save-buffer)
   '("\\W" . save-some-buffers)
   '("\\r" . meow-query-replace) ; calls 'query-replace'
   '("\\R" . meow-query-replace-regexp) ; calls 'query-replace-regexp'
   
   ;; EXTERNAL
   '("\\=" . quick-calc)
   '("\\m" . calc)
   '("\\M" . calc-other-window)
   '("\\c" . calc-embedded)
   '("\\C" . calc-embedded-word)

   ;; PROJECT
   '("\\f" . project-find-file)
   '("\\b" . project-switch-to-buffer)
   '("\\p" . project-switch-project)
   '("\\d" . project-find-dir)
   '("\\k" . project-kill-buffers)
   ;; '("\\g" . project-find-regexp)
   ;; '("\\r" . project-query-replace-regexp)
   '("\\/" . project-shell)
   '("\\g" . magit-status)))

(defconst ph/meow-common
  (list
   ;; '("M-c" . meow-clipboard-save) ;; was kill-ring-save
   ;; '("M-x" . meow-clipboard-kill)
   ;; '("M-v" . meow-clipboard-yank) ;; was yank
   ))
