.emacs.d/init.el

(defconst ph/meow-normal
  (list
   '("0" . meow-expand-0)
   '("1" . meow-expand-1)
   '("2" . meow-expand-2)
   '("3" . meow-expand-3)
   '("4" . meow-expand-4)
   '("5" . meow-expand-5)
   '("6" . meow-expand-6)
   '("7" . meow-expand-7)
   '("8" . meow-expand-8)
   '("9" . meow-expand-9)
   '(";" . meow-reverse)		; ' -> ;


   '("k" . meow-prev)
   '("j" . meow-next)
   '("h" . meow-left)
   '("l" . meow-right)

   '("v" . ph/scroll-up-half)
   '("V" . ph/scroll-down-half)

   '("n" . meow-search)		; y -> / -> ` -> / -> n
   '("N" . ph/meow-search-reverse)


   '("K" . meow-prev-expand)
   '("J" . meow-next-expand)
   '("H" . meow-left-expand)
   '("L" . meow-right-expand)

   '("u" . meow-back-word)
   '("U" . meow-back-symbol)
   '("o" . meow-next-word)
   '("O" . meow-next-symbol)

   '("w" . meow-mark-word)		; a -> w
   '("W" . meow-mark-symbol)		; A -> W
   '("e" . meow-line)			; s -> e
   '("E" . ph/meow-line-append)
   '("q" . meow-block)		; w -> q
   '("Q" . meow-to-block)
   '("s" . meow-join)			; q -> a -> h -> a
   '("S" . ph/meow-line-insert)	; H -> A
   '("g" . meow-grab)			; g -> h (see undo) -> g
   '("G" . meow-pop-grab)		; G -> H -> G
   '("m" . meow-swap-grab)
   '("M" . meow-sync-grab)
   '("~" . meow-cancel-selection)	; p -> [ -> t -> h -> H -> ~
   '("`" . meow-pop-selection)	; P -> { -> T -> H -> h -> `
   '("t" . meow-transpose-sexp)
   '("T" . transpose-lines)

   '("F" . meow-till)			; x -> t -> F
   '("f" . meow-find)			; z -> f

   '("[" . meow-beginning-of-thing)	; , -> [
   '("]" . meow-end-of-thing)		; . -> ]
   '("," . meow-inner-of-thing)	; < -> ,
   '("." . meow-bounds-of-thing)	; > -> .

   '("{" . backward-paragraph)
   '("}" . forward-paragraph)


   '("d" . meow-kill)
   '("D" . meow-kill-whole-line)
   '("S-<backspace>" . ph/kill-whole-line-move-prev) ;
   '("r" . ph/meow-change-save)	; f -> c -> r
   '("R" . meow-replace)
   '("x" . meow-delete)		; t -> x
   '("c" . meow-save)			; c -> y -> t -> ` -> c
   '("p" . meow-yank)			; v -> p
   '("P" . meow-yank-pop)		; V -> P

   '("i" . meow-insert)		; e -> s -> a -> i
   '("I" . meow-open-above)		; S -> R -> S -> I
   '("a" . meow-append)		; Vi-style append -> normal append
   '("A" . meow-open-below)		; E -> S -> A

   '("y" . undo-only)			; h -> g -> z -> b
   '("Y" . undo-redo)			; H -> G -> Z -> B

   '("z" . open-line)			; b -> z
   '("Z" . split-line)		; B -> Z

   '("=" . meow-indent)
   '("X" . ph/meow-join-with)

   ;; '("[" . indent-rigidly-left-to-tab-stop)
   ;; '("]" . indent-rigidly-right-to-tab-stop)



   '("-" . negative-argument)
   '("'" . repeat)			; dot-mode-execute
   '("\"" . meow-end-or-call-kmacro)    
   '("C-]" . meow-paren-mode) ;; ? -> C-]
   '("C-;" . meow-symex-mode)
   '("C-=" . meow-table-mode) ;; C-: -> C-=
   '("C-+" . meow-calc-mode)
   '("C->" . ph/meow-overwrite-enter)
   '("§" . cider-doc) ;; ! replace with generic selector

   ;; ignore escape
   '("<escape>" . ignore)))

(use-package meow
  :ensure t
  :demand t
  :after (hydra clj-refactor symex)
  :config
  (meow-global-mode 1)
  (meow-setup-indicator)

  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (setq meow-keypad-leader-dispatch "C-c")

  ;;; Prevent 'C-[' from triggering 'ESC' prefix-keymaps:
  ;;; see:
  ;;; https://github.com/meow-edit/meow/discussions/255#discussioncomment-2862406
  (define-key input-decode-map [?\C-\[] [C-\[])
  (define-key global-map [C-\[] [?\C-\M-§])
  
  ;;; Prevent 'C-i' and 'C-I' from acting as 'TAB' and 'S-TAB':
  ;; (define-key input-decode-map [?\C-i] [C-i])
  ;; (define-key input-decode-map [?\C-\S-i] [C-S-i])
  ;;

  ;; (add-to-list 'meow-mode-state-list
  ;; 	       '(( . motion)))


  (advice-add 'org-goto-location :before
	      (lambda (&rest r)
		(meow-motion-mode)))

  (advice-add 'org-goto :after
	      (lambda (&rest r)
		(meow-normal-mode)))

  ;;
  )

(use-package meow
  :config
  (meow-thing-register 'elisp-quoted
		       '(regexp "`" "`\\|'")
		       '(regexp "`" "`\\|'"))

  (meow-thing-register 'quoted
		       '(regexp "‘" "‘\\|’")
		       '(regexp "‘" "‘\\|’"))

  (meow-thing-register 'angle
		       '(pair ("<") (">"))
		       '(pair ("<") (">")))

  (setq meow-char-thing-table
	'((?f . round)
	  (?d . square)
	  (?s . curly)
	  (?a . angle)
	  (?n . quoted)
	  (?m . elisp-quoted)
	  (?r . string)
	  (?w . paragraph)
	  (?e . line)
	  (?q . buffer)))
  ;;
  )

(use-package meow
  :config
