.emacs.d/init.el

(defun ph/meow-org-table-field-insert (&optional n)
  "Inserts text from insert mode before the contents of table field."
  (interactive "p")
  ;; if on the 1. char in field, org moves to previous field
  ;; so we need to go from next char
  (meow-right)
  (org-table-beginning-of-field n)
  (meow-insert))

(defun ph/meow-org-table-field-append (&optional n)
  "Appends text from insert mode to the contents of table field."
  (interactive "p")
  (org-table-end-of-field n)
  (meow-append))

(defun ph/meow-org-table-kill ()
  "If no region is active, kills org-table row, otherwise uses `meow-kill'."
  (interactive)
  (if (region-active-p)
      (meow-kill)
      (org-table-kill-row)))

(defun ph/org-table-cut-region ()
  "Same as the original, but does not move the cursor."
  (interactive)
  (let ((beg (point))) ;; `save-excursion' doesn’t seem to work here
    (call-interactively 'org-table-cut-region)
    (goto-char beg)))

(defun ph/org-table-copy-region ()
  "Same as the original, but does not move the cursor."
  (interactive)
  (save-excursion
    (call-interactively 'org-table-copy-region)
    (when meow--selection
      (call-interactively 'meow-cancel-selection))))

(defun ph/meow-org-table-field-replace ()
  "Copies table field content before replacing it with the insertion."
  (interactive)
  (ph/org-table-cut-region)
  (meow-insert))

(defun ph/org-table-eval-align ()
  "(Re)evaluates formulas and realigns table."
  (interactive)
  (org-table-recalculate)
  (org-table-align))

(use-package meow
  :config

  (setq meow-table-keymap (make-keymap))
  (meow-define-state table
    "meow state for editing tables in Org mode"
    :lighter " [T]"
    :keymap meow-table-keymap)

  (setq meow-cursor-type-table 'hollow)

  (apply 'meow-define-keys 'table ph/meow-prefix-slash)  
  (apply 'meow-define-keys 'table ph/meow-prefix-backslash)  
  (apply 'meow-define-keys 'table ph/meow-common)
  (apply 'meow-define-keys 'table ph/meow-normal)
  
  (meow-define-keys 'table
    '("SPC" . meow-keypad)
    '("C-M-§" . meow-normal-mode)

    ;; normal meow movements do not form regions with mark, so use defaults:
    '("k" . previous-line)
    '("j" . next-line)
    '("h" . backward-char)
    '("l" . forward-char)
    
    '("K" . meow-prev-expand)
    '("J" . meow-next-expand)
    '("H" . meow-left-expand)
    '("L" . meow-right-expand)

    '("t" . hydra-table-move/body) ;; hjkl to move row/col / HJKL to move cell
    
    '("U" . org-shifttab)
    '("O" . org-cycle)

    '("S" . org-table-beginning-of-field)
    '("E" . org-table-end-of-field)

    '("I" . ph/meow-org-table-field-insert)
    '("A" . ph/meow-org-table-field-append)

    '("s" . hydra-table-insert/body) ;; hjkl for insertion of row/col
    '("d" . ph/meow-org-table-kill)
    '("D" . org-table-delete-column)

    ;; '("v" . org-table-copy-down) ;; already on S-RET
    
    '(":" . ph/meow-org-table-field-replace)

    ;; '("D" . org-table-blank-field)
    '("X" . ph/org-table-cut-region)
    '("C" . ph/org-table-copy-region)
    '("P" . org-table-paste-rectangle)
    
    '("q" . org-table-wrap-region)


    '("?" . org-table-field-info)

    '("+" . ph/org-table-eval-align)
    '("=" . org-table-eval-formula)

    )

  ;;
  )

(defun ph/meow-overwrite-enter ()
  (interactive)
  (overwrite-mode 1)
  (meow-overwrite-mode))

(defun ph/meow-overwrite-exit ()
  (interactive)
  (overwrite-mode -1)
  (meow-normal-mode))

(use-package meow
  :config

  (setq meow-overwrite-keymap (make-keymap))
  (meow-define-state overwrite
    "meow state wrapper for Emacs’s overwrite-mode."
    :lighter " [O]"
    :keymap meow-overwrite-keymap)

  (setq meow-cursor-type-overwrite 'hollow)

  ;; (apply 'meow-define-keys 'overwrite ph/meow-prefix-slash)  
  ;; (apply 'meow-define-keys 'overwrite ph/meow-prefix-backslash)  
  (apply 'meow-define-keys 'overwrite ph/meow-common)

  (meow-define-keys 'overwrite
    '("H-SPC" . meow-keypad)
    '("C-M-§" . ph/meow-overwrite-exit)

    ;; '("S-<backspace>" . ph/kill-whole-line-move-prev)
    ;; '("C-;" . meow-symex-mode)
    ;; '("C-]" . meow-paren-mode) ;; temporary workaround
    ;; '("C-=" . meow-table-mode)
    '("C-y" . meow-yank))

  ;;
  )

(use-package meow
  :config

  (setq meow-calc-keymap (make-keymap))
  (meow-define-state calc
    "Emacs’s calculator mode uses many unprefixed keys, so this meow
state (other than motion state) doesn’t bind anything."
    :lighter " [C]"
    :keymap meow-calc-keymap)

  ;; (setq meow-cursor-type-calc 'hollow)

  (apply 'meow-define-keys 'calc ph/meow-prefix-backslash)  

  (meow-define-keys 'calc
    '("SPC" . meow-keypad) ; was H-SPC
    '("C-M-§" . meow-normal-mode)  ; == C-[
    )


  ;; (add-hook 'calc-start-hook
  ;; 	    (lambda ()
  ;; 	      (meow-calc-mode)))

  ;; (add-hook 'calc-end-hook
  ;; 	    (lambda ()
  ;; 	      (meow-normal-mode)))

  ;; Hook doesn’t work when switching to an already open Calc window, but
  ;; this advice always works:
  (advice-add 'calc-mode :after (lambda () (meow-calc-mode)))

  ;; NOTE: this also works for calc-embedded-word, which calls calc-embedded
  (advice-add 'calc-embedded :after
	      (lambda (&rest r)
		(if calc-embedded-info
		    (meow-calc-mode)
		  (meow-normal-mode))))

  ;; Maybe this also works, haven’t tested yet:
  ;; (add-to-list 'meow-mode-state-list
  ;; 	       '((calc-mode . calc)
  ;; 		 (calc-embedded . calc)))


  (defface ph/meow-calc-cursor
    '((t (:background "green")))
    "Cursor face for meow calc state.")

  (add-to-list 'meow-update-cursor-functions-alist
	       '((lambda () (meow-calc-mode-p))
		 . (lambda ()
		     (progn
		       (meow--set-cursor-type 'box)
		       (meow--set-cursor-color 'ph/meow-calc-cursor)))))
  ;;
  )

;; (defun ph/)

(use-package meow
  :config

  ;;; INSERT STATE ;;;

  (meow-define-keys 'insert
    '("H-SPC" . meow-keypad)
    '("C-M-§" . meow-insert-exit)
    '("S-<backspace>" . ph/kill-whole-line-move-prev)
    '("C-;" . meow-symex-mode)
    '("C-]" . meow-paren-mode) ;; temporary workaround
    '("C-=" . meow-table-mode) ;; C-: -> C-=
    '("C-M-y" . meow-yank)
    )
  
  (apply 'meow-define-keys 'insert ph/meow-common)

  ;;; MOTION STATE OVERWRITES ;;;

  (meow-motion-overwrite-define-key
   '("k" . meow-prev)
   '("j" . meow-next)
   '("h" . meow-left)
   '("l" . meow-right)
   '("K" . meow-prev-expand)
   '("J" . meow-next-expand)
   '("H" . meow-left-expand)
   '("L" . meow-right-expand)

   '("v" . ph/scroll-up-half)
   '("V" . ph/scroll-down-half)
   '("{" . backward-paragraph)
   '("}" . forward-paragraph)
   '("C-+" . meow-calc-mode) ; sometimes its not activated automatically
   '("<escape>" . ignore))
  
  (apply 'meow-motion-overwrite-define-key ph/meow-prefix-backslash)
  (apply 'meow-motion-overwrite-define-key ph/meow-common)

  ;;; BEACON STATE ;;;
  
  (meow-define-keys 'beacon
    '("/m" . meow-beacon-start)
    '("/e" . meow-beacon-apply-kmacro)  
    '("<escape>" . ignore))

  ;;; NORMAL STATE ;;;

  (apply 'meow-define-keys 'normal ph/meow-prefix-slash)
  (apply 'meow-define-keys 'normal ph/meow-prefix-backslash)
  (apply 'meow-define-keys 'normal ph/meow-common)
  
  ;; The actual normal-mode bindings:
  (apply 'meow-define-keys 'normal ph/meow-normal)
  ;;
  )

(use-package meow
  :config
