.emacs.d/init.el

  (meow-leader-define-key
   ;; Hydras
   '("w" . hydra-window/body)
   '("V" . hydra-view-silent)
   '("z" . hydra-zoom/body)
   '("o" . hydra-org-silent)

   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet)

   ;; SPC j/k/l/h will run the original command in MOTION state.
   ;; '("j" . "H-j")
   ;; '("k" . "H-k")
   ;; '("l" . "H-l")
   ;; '("h" . "H-h")
   ;; '("v" . "H-v")
   ;; '("V" . "H-V")
   ;; '("{" . "H-{")
   ;; '("}" . "H-}")
   )
  ;;
  )

(use-package meow
  :config
  (add-hook 'meow-paren-mode-hook
	    (lambda () (keymap-unset clj-refactor-map "/")))
  (add-hook 'meow-symex-mode-hook
	    (lambda () (keymap-unset clj-refactor-map "/")))
  (add-hook 'meow-normal-mode-hook
	    (lambda () (keymap-unset clj-refactor-map "/")))
  (add-hook 'meow-insert-mode-hook
	    (lambda () (keymap-set clj-refactor-map "/" #'cljr-slash)))
  ;;
  )

(use-package magit
  :ensure t)

(use-package diff-hl
  :after (magit dired)
  :ensure t
  :diminish
  :init
  (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  :config
  (global-diff-hl-mode)
  (add-hook 'dired-mode-hook 'diff-hl-dired-mode))

(use-package org
  :config
  (setq org-id-link-to-org-use-id 'use-existing)

  ;;; Hide emphasis marker characters
  ;; (setq org-use-speed-commands t)

  ;;; Enable org-indent-mode on startup
  (setq org-startup-indented t)

  (setq org-hide-emphasis-markers t)
  ;;; Show entities as UTF8 characters
  (setq org-pretty-entities t)
  ;; I don’t want sub-/superscripts to display after every '^'/'_', since they
  ;; are often ambiguous and hard to read at small font size
  ;; - they still work when wrapped in '{}'
  (setq org-use-sub-superscripts '{})

  ;;; Avoid splitting of lines on M-RET (default was '(08.04.2024, 11:45)')
  (setq org-M-RET-may-split-line nil)

  ;;; Do not fold the subtree when yanked/pasted:
  (setq org-yank-folded-subtrees nil)

  ;; (setq org-startup-with-latex-preview t)

  ;; (setq org-edit-src-content-indentation 0)
  (setq org-src-preserve-indentation t)

  (setq org-directory "~/org")
  (setq org-default-notes-file (concat org-directory "/notes.org"))
  
  (setq org-src-window-setup 'current-window)

  ;; Automatically insert line breaks at char limit
  (add-hook 'org-mode-hook #'turn-on-auto-fill)

  ;; Emacs overwrites the bindings C-<tab> and C-c <tab> on Mac with
  ;; `mac-next-tab-or-toggle-tab-bar` and `mac-previous-tab-or-toggle-tab-bar`,
  ;; but I don’t really use the tab bar.

  ;; - Note: disabled C-c <tab> binding for now since it is being used by with
  ;; 'org-table-toggle-column-width'
  
  ;; (keymap-set org-mode-map "C-c <tab>" #'org-fold-show-children)
  (keymap-set org-mode-map "C-<tab>" #'org-kill-note-or-show-branches)
  (keymap-set org-mode-map "C-M-<tab>" #'org-fold-show-all)

  ;; (add-to-list 'display-buffer-alist
  ;; 	       '("^\\*Org Src" display-buffer-at-bottom
  ;; 		 (window-height . 0.5)))
  
  (setq org-goto-auto-isearch nil)

  ;; This enables to set the size for each image
  (setq org-image-actual-width nil)

  ;; Do not display images from web urls (doesn’t seem to work anyways)
  (setq org-display-remote-inline-images 'skip)

  ;; Eval code blocks without confirmation:
  (setq org-confirm-babel-evaluate nil)

  ;; Enable more languages for code block evaluation:
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (R . t)
     (dot . t)
     (shell . t)
     (clojure . t)))

  ;; (setq org-babel-clojure-backend 'babashka)
  (setq org-babel-clojure-backend 'cider)
  
  ;;
  )
