.emacs.d/init.org
*** +My custom keybindings for org-mode
#+begin_src elisp
(defun ph/org-insert-child-heading ()
  "Inserts a child heading from the current heading node."
  (interactive)
  (org-insert-heading-respect-content)
  (org-do-demote))

(defun ph/meow-org-insert-heading ()
  (interactive)
  (org-insert-heading-respect-content)
  (meow-insert))

(defun ph/meow-org-insert-child-heading ()
  (interactive)
  (ph/org-insert-child-heading)
  (meow-insert))

(defun ph/meow-org-insert-heading-above ()
  (interactive)
  (let ((start-level (funcall outline-level)))
    (when (> start-level 0)
      (org-back-to-heading))
    (org-insert-heading)
    (meow-insert)))


;; TODO maybe extract a more general function to make these DRYer:

(defun ph/meow-org-add-list-item ()
  (interactive)
  (org-end-of-line)
  (org-insert-item)
  (meow-append))

(defun ph/meow-org-add-above-list-item ()
  (interactive)
  (org-beginning-of-line)
  (org-insert-item)
  (meow-insert))

(defun ph/meow-org-add-lower-list-item ()
  (interactive)
  (org-end-of-line)
  (org-insert-item)
  (org-indent-item)  
  (meow-append))

(defun ph/meow-org-add-todo-item ()
  (interactive)
  (org-end-of-line)
  (org-insert-item t)
  (meow-append))

(defun ph/meow-org-add-above-todo-item ()
  (interactive)
  (org-beginning-of-line)
  (org-insert-item t)
  (meow-insert))

(defun ph/meow-org-add-lower-todo-item ()
  (interactive)
  (org-end-of-line)
  (org-insert-item t)
  (org-indent-item)  
  (meow-append))


;; Adapted from https://emacs.stackexchange.com/a/64640 (user NickD)

(defun ph/org-redisplay-inline-image-at-point ()
  (interactive)
  (let* ((context (org-element-context (org-element-at-point)))
	 (type (org-element-type context))
	 (beg  (plist-get (cadr context) :begin))
	 (end  (plist-get (cadr context) :end)))
    (when (eq type 'link)
      (org-display-inline-images nil t beg end))))

(defun ph/org-toggle-inline-image-at-point ()
  (interactive)
  (let* ((context (org-element-context (org-element-at-point)))
	 (type (org-element-type context))
	 (beg  (plist-get (cadr context) :begin))
	 (end  (plist-get (cadr context) :end)))
    (when (eq type 'link)
      (org-toggle-inline-images nil beg end))))


(defun ph/org-insert-radio-target-brackets (&optional arg)
  "Surround selected text with Org Radio Target angle brackets (e.g. `<<<foo>>>`) and then find and update all radio targets."
  (interactive)
  (progn
    (insert-pair arg "<<<" ">>>")
    (org-update-radio-target-regexp)))

;; (defun ph/org-insert-radio-target-brackets (start end)
;;   "Wraps a region with angular brackets to create a radio target."
;;   (interactive "r")
;;   (save-excursion
;;     (goto-char end)
;;     (insert ">>>")
;;     (goto-char start)
;;     (insert "<<<")))


(use-package org
  :config
  ;; Global bindings as recommended by the org manual:
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)

  ;; Local bindings:
  (keymap-set org-mode-map "C-c j" #'ph/meow-org-insert-heading)
  (keymap-set org-mode-map "C-c J" #'ph/meow-org-insert-heading-above)
  (keymap-set org-mode-map "C-c M-j" #'ph/meow-org-insert-child-heading)
  
  (keymap-set org-mode-map "C-c i" #'ph/meow-org-add-list-item)
  (keymap-set org-mode-map "C-c I" #'ph/meow-org-add-above-list-item)
  (keymap-set org-mode-map "C-c M-i" #'ph/meow-org-add-lower-list-item)
  (keymap-set org-mode-map "C-c x" #'ph/meow-org-add-todo-item)
  (keymap-set org-mode-map "C-c X" #'ph/meow-org-add-above-todo-item)
  (keymap-set org-mode-map "C-c M-x" #'ph/meow-org-add-lower-todo-item)

  (keymap-set org-mode-map "C-c p p" #'ph/org-toggle-inline-image-at-point)
  (keymap-set org-mode-map "C-c p r" #'ph/org-redisplay-inline-image-at-point)
  
  ;; meow somehow messes up the `C-c SPC' mapping, so I have to rebind it:
  (keymap-set org-mode-map "C-c d" #'org-table-blank-field)

  (keymap-set org-mode-map "C-c n r" #'ph/org-insert-radio-target-brackets)
  
  ;; org-goto keybindings:
  ;; (keymap-set org-goto-map "j" #'outline-next-visible-heading)
  ;; (keymap-set org-goto-map "k" #'outline-previous-visible-heading)
  ;; (keymap-set org-goto-map "h" #'org-goto-left)
  ;; (keymap-set org-goto-map "l" #'org-goto-right)

  ;;
  )
#+end_src
*** +My custom links for org-mode
#+begin_src elisp
(use-package org
  :config
  ;; Enable following links in TheBrain
  (org-link-set-parameters
   "brain"
   :follow (lambda (path) (ph/macos-open (concat "brain:" path)))
   ;; :store #'org-brain-store-link
   ))
#+end_src
*** +My custom capture templates
#+begin_src elisp
(defun ph/org-id-store-create ()
  (interactive)
  (org-id-get-create)
  (call-interactively #'org-store-link))

(defun ph/org-top-parent-heading ()
  (interactive)
  (while (org-up-heading-safe)))

(defun ph/org-capture-fw-ref ()
  (interactive)
  (org-capture nil "f"))

(keymap-global-set "C-c f" #'ph/org-capture-fw-ref)

(use-package org
  :config

  (setq org-capture-templates
	'(("t" "Task" entry (file+headline "" "Tasks")
	   "* TODO %?\n  %u\n  %a")
	  ;; ("x" "XXX" entry (file+headline "" "Test")
	  ;;  "* TODO %^{Task}\n  %^{Description}\n  %\\1\n")
	  ("f" "FW Reference" entry (file "~/org/fw-refs.org")
	   "* %^{Label}\n:PROPERTIES:\n:AUTHOR: %n\n:CAPTURED: %T\n:ORIGIN_CAPTURED: %a\n:END:\n- %\\1 :: %^{RefSign|→|→|>|⇔} %^{Referent}\n** Drafts\n*** %<%Y-%m-%d>\n1. %\\2 %\\3%?\n** Notes"
	   :before-finalize (lambda ()
			      (ph/org-top-parent-heading)
			      (ph/org-id-store-create)))))

  ;;
  )

(defun ph/org-transclude-ref ()
  (interactive)
  (let ((context (org-element-lineage
                  (org-element-context)'(link) t)))
    (let* ((contents-beg (org-element-property :contents-begin context))
	   (contents-end (org-element-property :contents-end context))
	   (contents (when contents-beg
		       (buffer-substring-no-properties
			contents-beg contents-end)))
	   (link (org-element-link-interpreter context contents)))
      (save-excursion
	(org-transclusion-search-or-add-next-empty-line)
	(insert (format "#+transclude: %s :only-contents :exclude-elements \"headline drawer\"\n" link))
	(org-transclusion-add)
	(forward-line -1)))))
#+end_src
*** +My custom orgtbl converter
#+begin_src elisp
(defun ph/orgtbl-to-ssv (table params)
  "Convert the `orgtbl-mode' TABLE to SEMICOLON separated material.
Adapted from `orgtbl-to-tsv'."
  (orgtbl-to-generic table (org-combine-plists '(:sep ";") params)))
#+end_src
*** +My fix for ~org-fill-paragraph~ in ~org-indent-mode~

Fix for ~org-fill-paragraph~ in ~org-indent-mode~, which fails to integrate
the indentation. Overrides ~current-fill-column~ to ensure the correct
calculation.
- credits to patrick: https://emacs.stackexchange.com/a/74973

#+begin_src elisp
(use-package org
  :config
  (defun current-fill-column ()
    "Return the fill-column to use for this line.
Subtracts right margin and org indentation level from fill-column"
    (let ((indent-level (if (and (bound-and-true-p org-indent-mode)
				 (org-current-level)) ;; -> not level 0
			    (* org-indent-indentation-per-level
			       (org-current-level))
			  0))
	  (margin (or (get-text-property (point) 'right-margin) 0)))
      (- fill-column indent-level margin))))
#+end_src

*** org-cite (built-in)
:PROPERTIES:
:CUSTOM_ID: org-cite
:END:
#+begin_src elisp
(use-package org-cite
  :custom
  ;; Using my global bib exclusively in Org-roam, so I should be able to resolve
  ;; the references there even when I lose my config.
  (org-cite-global-bibliography
   '("~/Documents/Org-roam/bibliography/master-lib.bib"))
  (org-cite-csl-styles-dir "~/Zotero/styles")
  ;; Not yet sure if I want to keep this style, but using it for now.
  (org-cite-export-processors
   '((t . (csl "chicago-fullnote-bibliography.csl"))))
  ;; :bind
  ;; (:map org-mode-map :package org ("C-c b" . #'org-cite-insert))
  ;;
  )
#+end_src

