.emacs.d/init.org
*** org-appear
#+begin_src elisp
;; somehow disabling `org-appear-mode' hides emphasis markers completely,
;; otherwise they only show permanently if the cursor is on the same line
(defun ph/toggle-org-emphasis-markers ()
  (interactive)
  (if org-hide-emphasis-markers
      (progn
	(message "Emphasis markers VISIBLE")
	(setq org-hide-emphasis-markers nil)
	;; (org-appear-mode 1)
	)
    (progn
      (message "Emphasis markers HIDDEN")
      (setq org-hide-emphasis-markers t)
      ;; (org-appear-mode -1)
      )))

(use-package org-appear
  :ensure t
  :diminish
  :after org
  :hook org-mode
  :custom
  (org-appear-autoentities t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers nil)
  :config
  (setq org-appear-trigger 'manual)
  (add-hook 'org-mode-hook (lambda ()
                             (add-hook 'meow-insert-enter-hook
                                       #'org-appear-manual-start
                                       nil
                                       t)
                             (add-hook 'meow-insert-exit-hook
                                       #'org-appear-manual-stop
                                       nil
                                       t)))

  (keymap-set org-mode-map "C-c e" #'ph/toggle-org-emphasis-markers)
  ;;
  )
#+end_src
*** org-transclusion
#+begin_src elisp
;; Somehow the fringe in target buffer does not show up.
;; Workaround, source:
;; - https://github.com/nobiot/org-transclusion/issues/201#issue-1868665106
;; - UPDATE: seems to mess with indentation -> unusable
;; (defun org-transclusion-content-insert-add-overlay (beg end)
;;   "Add fringe after transclusion."
;;   (overlay-put (text-clone-make-overlay beg end (current-buffer))
;; 	       'line-prefix
;; 	       (org-transclusion-propertize-transclusion))
;;   (overlay-put (text-clone-make-overlay beg end (current-buffer))
;; 	       'wrap-prefix
;; 	       (org-transclusion-propertize-transclusion)))

(use-package org-transclusion
  :pin elpa-devel
  :ensure t
  :after org
  :config
  (add-to-list 'org-transclusion-extensions 'org-transclusion-indent-mode)
  (require 'org-transclusion-indent-mode)

  (keymap-set org-mode-map "C-c v a" #'org-transclusion-add)
  (keymap-set org-mode-map "C-c v m" #'org-transclusion-mode)

  (keymap-set org-transclusion-map "C-c v e" #'org-transclusion-live-sync-start)
  (keymap-set org-transclusion-map "C-c v g" #'org-transclusion-refresh)
  (keymap-set org-transclusion-map "C-c v d" #'org-transclusion-remove)
  (keymap-set org-transclusion-map "C-c v C-d" #'org-transclusion-detach)
  (keymap-set org-transclusion-map "C-c v P" #'org-transclusion-promote-subtree)
  (keymap-set org-transclusion-map "C-c v D" #'org-transclusion-demote-subtree)
  (keymap-set org-transclusion-map "C-c v o" #'org-transclusion-open-source)
  (keymap-set org-transclusion-map "C-c v O" #'org-transclusion-move-to-source)
  
  (keymap-set org-transclusion-live-sync-map "C-c v C-c C-c"
	      #'org-transclusion-live-sync-exit)
  (keymap-set org-transclusion-live-sync-map "C-c v C-y"
	      #'org-transclusion-live-sync-paste)

  ;; (add-hook 'org-transclusion-after-add-functions
  ;; 	    #'org-transclusion-content-insert-add-overlay)
  )
#+end_src
*** org-roam
#+begin_src elisp
;; (use-package emacsql-sqlite-builtin
;;   :ensure t)

(use-package org-roam
  :ensure t
  ;; :after emacsql-sqlite-builtin
  ;; :after (org emacsql-sqlite-builtin)
  :custom
  (org-roam-directory (file-truename "~/Documents/Org-roam"))
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
	 ("C-c n f" . org-roam-node-find)
	 ("C-c n g" . org-roam-graph)
	 ("C-c n i" . org-roam-node-insert)
	 ("C-c n c" . org-roam-capture)
	 
	 ;; Dailies
	 ("C-c n j" . org-roam-dailies-capture-today)
	 ("C-c n J" . org-roam-dailies-capture-yesterday)
	 ("C-c n M-j" . org-roam-dailies-capture-date)
	 
	 ("C-c n o" . org-roam-dailies-goto-today)
	 ("C-c n O" . org-roam-dailies-goto-yesterday)
	 ("C-c n M-o" . org-roam-dailies-goto-date)
	 
	 ("C-c n p" . org-roam-dailies-goto-previous-note)
	 ("C-c n n" . org-roam-dailies-goto-next-note)
	 :map org-mode-map
	 ("C-M-i" . completion-at-point))
  :config
  ;; (org-roam-database-connector 'sqlite)
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"
           :target (file+head "%<%Y-%m-%d>.org"
                              "#+title: %<%Y-%m-%d>\n"))))

  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  (require 'org-roam-protocol)

  (setq org-roam-graph-executable "dot")
  ;; (setq org-roam-graph-viewer "")

  ;; (add-to-list 'display-buffer-alist
  ;;              '("\\*org-roam\\*"
  ;; 		 (display-buffer-pop-up-frame)
  ;; 		 (inhibit-switch-frame)
  ;; 		 (pop-up-frame-parameters
  ;; 		  (width . 40))
  ;; 		 ))

  (add-to-list 'display-buffer-alist
	       '("\\*org-roam\\*"
		 (display-buffer-in-direction)
		 (direction . right)
		 (window-width . 0.33)
		 (window-height . fit-window-to-buffer)))
  
  )

#+end_src
*** org-roam-ui
#+begin_src elisp
(use-package org-roam-ui
  :ensure t
  :after org-roam
  ;;         normally we'd recommend hooking orui after org-roam, but since
  ;;         org-roam does not have a hookable mode anymore, you're advised to
  ;;         pick something yourself if you don't care about startup time, use
  ;;         :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
	org-roam-ui-follow t
	org-roam-ui-update-on-save t
	org-roam-ui-open-on-start t))
#+end_src
*** COMMENT org-autolist
#+begin_src elisp
(use-package org-autolist
  :diminish
  :ensure t
  :after org
  :hook (org-mode . org-autolist-mode))
#+end_src
*** COMMENT org-excalidraw
Doesn’t work - wait for updates, especially on [[https://github.com/wdavew/org-excalidraw/pull/6][this PR]].
- can only open links in Excalidraw, but not display images
- generates svg though
#+begin_src elisp
(use-package org-excalidraw
  :ensure t
  :vc (:fetcher github :repo wdavew/org-excalidraw)
  :config
  (setq org-excalidraw-directory "~/Pictures/org-excalidraw")
  
  (file-notify-add-watch org-excalidraw-directory '(change)
			 'org-excalidraw--handle-file-change)
  ;; (add-to-list 'org-file-apps
  ;; 	       '("\\.excalidraw.svg\\'" . (lambda (path link)
  ;; 					    (org-excalidraw--open-file-from-svg
  ;; 					     path))))
  )
#+end_src

** Snippets
*** yasnippet
#+begin_src elisp
(use-package yasnippet
  :ensure t
  :diminish
  :config
  (yas-global-mode 1))
#+end_src

** Appearance
*** rainbow-mode
#+begin_src elisp
(use-package rainbow-mode
  :ensure t
  :diminish
  :hook org-mode prog-mode)
#+end_src

*** beacon (highlight my cursor)
#+begin_src elisp
(use-package beacon
  :ensure t
  :diminish
  :config
  (beacon-mode 1))
#+end_src

*** nerd-icons
#+begin_src elisp
(use-package nerd-icons
  :ensure t
  :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  (nerd-icons-font-family "BerkeleyMono Nerd Font Mono"))
#+end_src

** Layout
*** popper
#+begin_src elisp
(use-package popper
  :ensure t
  :bind (("C-`"   . popper-toggle)
	 ("M-§"   . popper-cycle) ;; was handle-switch-frame
	 ("C-M-`" . popper-toggle-type))
  :init
  (setq popper-display-control t)
  (setq popper-display-function
	(lambda (buffer &optional alist)
	  (if (string= (buffer-name buffer) "*Org Help*")
	      ;; popper auto-focusses the help buffer for `org-goto', which is
	      ;; not what I want, so I prevent it here

	      ;; NOTE: there may be other 'Org Help' buffers where I would want
	      ;; that, but I don’t know yet how to test for the org-goto help
	      ;; buffer only
	      
	      ;; using this doesn’t worK:
	      ;; (popper-display-popup-at-bottom buffer alist)
	      ;; but this does:
	      nil
	    (popper-select-popup-at-bottom buffer alist))))

  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
	  "\\*cider-doc\\*"
          help-mode
          compilation-mode))
  (popper-mode +1)
  (popper-echo-mode +1)
  
  :config
  ;;
  )
#+end_src
*** rotate
#+begin_src elisp
(use-package rotate
  :ensure t)
#+end_src

** Minibuffer / Completion
*** savehist /(built-in)/
Persists history over Emacs restarts. Vertico sorts by history position.
#+begin_src elisp
(use-package savehist
  :diminish
  :init
  (setq history-length 50)
  (savehist-mode 1))

#+end_src
