.emacs.d/init.org
*** COMMENT Fido /(built-in)/
#+begin_src elisp
(use-package fido
  :config
  (fido-mode 1)
  ;; (fido-vertical-mode 1)

  ;; because M-x <up> is awkward:
  (keymap-set icomplete-fido-mode-map "C-r"
	      #'minibuffer-complete-history)
  
  ;;
  )

(use-package emacs
  :config
  (setq completions-format 'horizontal)
  (setq completion-auto-wrap t) ;; wraps around when navigating completions
  (setq completion-auto-help t)
  (setq completion-auto-select 'second-tab)
  (setq completion-show-help nil) ;; hides help message

  (add-hook 'minibuffer-mode-hook
	    (lambda ()
	      (keymap-set minibuffer-mode-map "C-n"
			  #'minibuffer-next-completion)
	      (keymap-set minibuffer-mode-map "C-p"
			  #'minibuffer-previous-completion)))

  (add-hook 'completion-in-region-mode-hook
	    (lambda ()
	      (keymap-set completion-in-region-mode-map "C-n"
			  #'minibuffer-next-completion)
	      (keymap-set completion-in-region-mode-map "C-p"
			  #'minibuffer-previous-completion)))

  ;;
  )
#+end_src
*** vertico (minibuffer completion frontend)
#+begin_src elisp
(use-package vertico
  :ensure t
  :after savehist
  :init
  (vertico-mode 1))

;; As suggested by: https://github.com/minad/vertico
(use-package emacs
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
		  (replace-regexp-in-string
		   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
		   crm-separator)
		  (car args))
	  (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  (setq read-extended-command-predicate
        #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t)

  ;;
  )

#+end_src
*** orderless (backend completion style)
#+begin_src elisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles basic partial-completion))))
  ;;
  )

#+end_src
*** marginalia (completion annotations)
#+begin_src elisp
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :ensure t
  :bind (:map minibuffer-local-map
	      ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode)

  :config
  (setq marginalia-field-width 80) ; 43 in Doom
  
  (add-hook 'icomplete-minibuffer-setup-hook
	    (lambda () (setq truncate-lines t)))
  
  (add-hook 'completion-list-mode-hook
	    (lambda () (setq truncate-lines t)))

  ;; Disable Marginalia in *completions* buffer for non-one-column formats
  ;; -> doesn’t work
  ;; - https://github.com/minad/marginalia/issues/129
  ;; (defun disable-marginalia ()
  ;;   (when (and (equal t fido-mode)
  ;; 	       (not (eq completions-format 'one-column)))
  ;;     (setq-local marginalia-annotator-registry nil)))
  ;; (add-hook 'completion-list-mode-hook #'disable-marginalia)
  )
#+end_src
*** embark
#+begin_src elisp
(use-package embark
  :ensure t
  :bind
  (("C-." . embark-act)         ;; pick some comfortable binding
   ("C-;" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))
#+end_src
*** corfu (in-buffer completion)
#+begin_src elisp
(use-package corfu
  :ensure t
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  ;; (corfu-auto t)                 ;; Enable auto completion
  (corfu-separator ?\s)          ;; Orderless field separator
  ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin
  :init
  (global-corfu-mode)
  ;;
  )

;; as recommended in https://github.com/minad/corfu
(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete))
#+end_src
*** COMMENT company (text completion)
*Note:* there is a strange error where emacs keeps asking ~Visit tags table
 (default TAGS): …~ in the echo area when trying to visit a link in
 org-mode, even if TAGS aren’t used. This seems to be related to company
 mode somehow.
- [[https://github.com/haskell/haskell-mode/issues/1234][Emacs keeps asking for a TAGS file when TAGS aren't used #1234]]

#+begin_src elisp
(use-package company
  :ensure t
  :defer t
  :diminish
  :init (add-hook 'after-init-hook 'global-company-mode))

;; ? needed
;; (use-package company-box
;;   :after company
;;   :diminish
;;   :hook (company-mode . company-box-mode))
#+end_src

** Breadcrumbs
#+begin_src elisp
(use-package breadcrumb
  :ensure t
  :diminish
  :init
  (breadcrumb-mode)
  ;;
  )
#+end_src

** Cross-references
*** COMMENT dumb-jump (jump to definition, etc. (file searchers for xref)
Needed because eglot?
#+begin_src elisp
(use-package dumb-jump
  :ensure t
  :diminish
  :init (add-hook 'xref-backend-functions #'dumb-jump-xref-activate))

;; Compiler Warnings:
;; Warning (bytecomp): ‘point-at-bol’ is an obsolete function (as of 29.1); use ‘line-beginning-position’ or ‘pos-bol’ instead.
;; Warning (bytecomp): the function ‘xref-make-file-location’ is not known to be defined.
;; Warning (bytecomp): the function ‘xref-make’ is not known to be defined.
;; Warning (bytecomp): the function ‘first’ is not known to be defined.
;; Warning (bytecomp): the function ‘tramp-dissect-file-name’ is not known to be defined.
;; Warning (bytecomp): the function ‘tramp-file-name-localname’ is not known to be defined.
;; Warning (bytecomp): the function ‘helm-make-source’ is not known to be defined.
;; Warning (bytecomp): the function ‘ivy-read’ is not known to be defined.
#+end_src

** Linter
*** flycheck/
**** COMMENT +My flycheck-prefer-eldoc
Source: [[https://www.masteringemacs.org/article/seamlessly-merge-multiple-documentation-sources-eldoc][masteringemacs]]
#+begin_src elisp
(defun ph/flycheck-eldoc (callback &rest _ignored)
  "Print flycheck messages at point by calling CALLBACK."
  (when-let ((flycheck-errors (and flycheck-mode (flycheck-overlay-errors-at (point)))))
    (mapc
     (lambda (err)
       (funcall callback
		(format "%s: %s"
			(let ((level (flycheck-error-level err)))
			  (pcase level
			    ('info (propertize "I" 'face 'flycheck-error-list-info))
			    ('error (propertize "E" 'face 'flycheck-error-list-error))
			    ('warning (propertize "W" 'face 'flycheck-error-list-warning))
			    (_ level)))
			(flycheck-error-message err))
		:thing (or (flycheck-error-id err)
			   (flycheck-error-group err))
		:face 'font-lock-doc-face))
     flycheck-errors)))

(defun ph/flycheck-prefer-eldoc ()
  (add-hook 'eldoc-documentation-functions #'ph/flycheck-eldoc nil t)
  (setq eldoc-documentation-strategy 'eldoc-documentation-compose-eagerly)
  (setq flycheck-display-errors-function nil)
  (setq flycheck-help-echo-function nil))

#+end_src
**** flycheck
#+begin_src elisp
(use-package flycheck
  :ensure t
  :defer t
  :after eldoc
  :diminish
  :init (global-flycheck-mode)
  ;; :hook ((flycheck-mode . ph/flycheck-prefer-eldoc))
  :config
  ;; emacs-lisp-checkdoc checker is annoying in emacs-lisp-mode,
  ;; so I disable it there:
  (add-hook 'emacs-lisp-mode-hook
	    (lambda ()
	      (setq-local flycheck-disabled-checkers
			  '(emacs-lisp-checkdoc)))))
#+end_src
**** flycheck-color-mode-line
#+begin_src elisp
(use-package flycheck-color-mode-line
  :ensure t
  :diminish
  :after flycheck
  :hook flycheck-mode)
#+end_src
**** flycheck-clj-kondo
#+begin_src elisp
(use-package flycheck-clj-kondo
  :ensure t
  :after (flycheck clojure-mode)
  :diminish
  :config
  ;; ? how to disable elisp undefined warnings
  )
#+end_src
**** COMMENT flycheck-janet
#+begin_src elisp
(use-package flycheck-janet
  :ensure t
  :after (flycheck janet-ts-mode)
  :diminish
  :vc (:fetcher github :repo sogaiu/flycheck-janet))
#+end_src
**** COMMENT flycheck-rjan (for Janet)
#+begin_src elisp
(use-package flycheck-rjan
  :ensure t
  :after (flycheck janet-ts-mode flycheck-janet)
  :diminish
  :vc (:fetcher github :repo sogaiu/flycheck-rjan)
  :config
  (flycheck-add-next-checker 'janet-rjan 'janet-janet))
#+end_src
** Structural editing
