.emacs.d/init.org
**** symex replacements for copy/paste
#+begin_src elisp
;; ! may need adjustment
(defun ph/symex-ts--paste (count direction)
  "Paste before or after symex, COUNT times, according to DIRECTION.

DIRECTION should be either the symbol `before' or `after'."
  (interactive)
  (when (symex-ts-get-current-node)
    (symex-ts--handle-tree-modification
     (let* ((node (symex-ts-get-current-node))
	    (start (tsc-node-start-position node))
	    (end (tsc-node-end-position node))
	    (indent-start (save-excursion (back-to-indentation) (point)))
	    (block-node (or (not (= (line-number-at-pos start)
				    (line-number-at-pos end)))
			    (and (= start indent-start)
				 (= end (line-end-position))))))
       (goto-char (if (eq direction 'before) start end))
       (dotimes (_ count)
	 (when (eq direction 'after) (insert (if block-node "\n" " ")))
	 ;; (yank)
	 (meow-yank)
	 (when (eq direction 'before) (insert (if block-node "\n" " "))
	       (indent-according-to-mode)))))))


(defun ph/symex-ts-paste-before (count)
  "Paste before symex, COUNT times."
  (interactive)
  (ph/symex-ts--paste count 'before))

(defun ph/symex-lisp--paste-before ()
  "Paste before symex."
  (interactive)
  (let ((extra-to-append
         (cond ((or (and (symex--point-at-indentation-p)
                         (not (bolp)))
                    (save-excursion (forward-sexp)
                                    (eolp)))
                "\n")
               (t " "))))
    (save-excursion
      ;; (save-excursion
      ;;   (evil-paste-before nil nil)
      ;;   (when evil-move-cursor-back
      ;;     (forward-char))
      ;;   (insert extra-to-append))
      (meow-yank) ;; ++
      (insert extra-to-append) ;; ++
      (symex--go-forward)
      ;; (symex-tidy)
      )
    (symex-tidy)))

(defun ph/symex-paste-before (count)
  "Paste before symex, COUNT times."
  (interactive "p")
  (setq this-command 'meow-yank) ;; 'evil-paste-before
  (if (symex-tree-sitter-p)
      (ph/symex-ts-paste-before count)
    (symex--with-undo-collapse
      (dotimes (_ count)
        (ph/symex-lisp--paste-before)))))


(defun ph/symex-ts-paste-after (count)
  "Paste after symex, COUNT times."
  (interactive)
  (ph/symex-ts--paste count 'after))

(defun ph/symex-lisp--paste-after ()
  "Paste after symex."
  (interactive)
  (let ((extra-to-prepend
         (cond ((or (and (symex--point-at-indentation-p)
                         (not (bolp)))
                    (save-excursion (forward-sexp)
                                    (eolp)))
                "\n")
               (t " "))))
    (save-excursion
      (forward-sexp)
      (insert extra-to-prepend)
      ;; (evil-paste-before nil nil)
      (meow-yank))
    (symex--go-forward)
    (symex-tidy)))

(defun ph/symex-paste-after (count)
  "Paste after symex, COUNT times."
  (interactive "p")
  (setq this-command 'meow-yank) ;; 'evil-paste-after
  (if (symex-tree-sitter-p)
      (ph/symex-ts-paste-after count)
    (symex--with-undo-collapse
      (dotimes (_ count)
        (ph/symex-lisp--paste-after)))))

#+end_src
**** symex meow additions
#+begin_src elisp
;; ? Not sure if this has unforeseen side-effects
(defun ph/pop-item-kill-ring ()
  "Pops the most recently killed item in kill ring and sets the
pointer accordingly."
  (when kill-ring
    (let ((top-kill (car kill-ring)))
      (setf kill-ring (cdr kill-ring))
      (setf kill-ring-yank-pointer kill-ring)
      top-kill)))

(defun ph/push-item-kill-ring (item)
  "Pushes given `item' to kill-ring as the recently killed item and
sets the pointer accordingly."
  (when kill-ring
    (setf kill-ring (cons item kill-ring))
    (setf kill-ring-yank-pointer kill-ring)))

(defun ph/symex-replace-by-yank ()
  "Replaces selected sexp by the top item in `kill-ring', keeping it
on top while pushing the killed sexp below it. This way, the same
replacement can be made multiple times and the replaced sexps
still remain accessible by `yank-pop'."
  (interactive)
  (ph/symex-paste-before 1)
  (call-interactively #'symex-go-forward)
  (let ((yank-item (ph/pop-item-kill-ring)))
    (symex-delete 1)
    (ph/push-item-kill-ring yank-item)))

#+end_src
**** symex
Issues waiting to be resolved (maybe in 2.0 release?):
- remove tree-sitter dependency (this is now built-in in Emacs 29+)
- remove evil dependency (no need for that with meow)
- hopefully trim other dependencies like lispy too

[[https://github.com/drym-org/symex.el/blob/c3f000e037c62523267d3a89f14ac24cd8acc9fb/symex-hydra.el][Example-integration of symex with hydra]]
- also see [[https://github.com/drym-org/symex.el/pull/118][Replace evil -- first pass #118 (GitHub)]]

#+begin_src elisp
(use-package symex
  :ensure t
  ;; :after janet-ts-mode
  :config
  (symex-initialize)
  ;; (global-set-key (kbd "s-;") 'symex-mode-interface)

  ;; (setq symex-highlight-p nil)

  ;; symex-mode has functions that react on tree-sitter-mode with different
  ;; implementations, possibly breaking my meow integration, so I overwrite
  ;; the predicate to check for that to prevent activation.
  (defvar ph/symex-use-tree-sitter nil)
  ;; !! overwrite
  (defun symex-tree-sitter-p ()
    "Whether to use the tree sitter primitives."
    (and ph/symex-use-tree-sitter
	 tree-sitter-mode
	 ;; We use the Lisp primitives for Clojure
	 ;; even though Emacs 29 provides tree-sitter APIs
	 ;; for it, since the Lisp primitives in Symex are
	 ;; more mature than the Tree Sitter ones at the
	 ;; present time.
	 (not (member major-mode symex-clojure-modes))))

  )
#+end_src
**** meow-tree-sitter
#+begin_src elisp
(use-package meow-tree-sitter
  :ensure t
  :after meow
  :custom
  (meow-tree-sitter-queries-dir
   (expand-file-name "meow-tree-sitter/queries" user-emacs-directory))
  :config
  ;; (meow-tree-sitter-register-defaults)
  ;; (meow-tree-sitter-register-thing ?F "function")
  ;; (meow-tree-sitter-register-thing ?b "function")
  ;; (meow-tree-sitter-register-thing ?B "parameter")

  (dolist (bind '((?c . "class")
		  (?v . "function")
		  (?t . "test")
		  (?y . "entry")
		  (?, . "parameter")
		  (?/ . "comment")))
    (meow-tree-sitter-register-thing (car bind) (cdr bind)))
  ;;
  )
#+end_src

*** COMMENT lispy
#+begin_src elisp
(use-package lispy
  :ensure t
  :hook ((emacs-lisp-mode clojure-mode lisp-mode) . lispy-mode)
  ;; :config
  ;; (eval-after-load "lispy"
  ;;   `(progn
  ;;      (lispy-define-key lispy-mode-map "S" 'special-lispy-visit)))
  )
#+end_src
** tree-sitter/
*** treesit /(built-in)/
*NOTE:* ~tree-sitter~ is the third-party package, ~treesit~ is the built-in one!

#+begin_src elisp
(use-package treesit
  :config
  (setq-default treesit-font-lock-level 4)
  ;;
  )
#+end_src

*** treesit-auto
Automatically installs TS grammars and uses corresponding ts-modes.
- might become obsolete with Emacs versions above 29
#+begin_src elisp
(use-package treesit-auto
  :ensure t
  ;; :after treesit
  :diminish
  :custom
  (treesit-auto-install 'prompt)
  :config

  ;; Construct `treesit-language-source-alist` using all known recipes:
  ;; (setq treesit-language-source-alist
  ;; 	(treesit-auto--build-treesit-source-alist))

  (treesit-auto-add-to-auto-mode-alist 'all)

  ;; treesit seems to want to load `janet-simple' instead of `janet' lang
  ;; so I add the grammar again as `janet-simple'
  (setq janet-simple-tsauto-config
	(make-treesit-auto-recipe
	 :lang 'janet-simple
	 :ts-mode 'janet-ts-mode
	 :remap 'janet-mode
	 :url "https://github.com/sogaiu/tree-sitter-janet-simple"
	 :ext "\\.janet\\'"))

  (add-to-list 'treesit-auto-recipe-list janet-simple-tsauto-config)
  (delete 'janet treesit-auto-langs)

  (global-treesit-auto-mode)

  ;; Fix language sources not being added to `treesit-language-source-alist`
  (setq treesit-language-source-alist
	(treesit-auto--build-treesit-source-alist))
  ;;
  )
#+end_src

** LSP support
*** eldoc /(built-in -> shadowed)/
- installed manually from ~describe-package eldoc~, because built-in version
  is outdated
  - somehow Emacs still uses the built-in version instead of the newer
    one, cannot fix this with the obvious approaches, no luck finding
    answers or asking AI
  - see https://elpa.gnu.org/packages/eldoc.html
#+begin_src elisp
  (use-package eldoc
    :ensure t
    :pin elpa
    :config
    ;; ? enabled by default
    ;; (global-eldoc-mode 1)
    
    ;; ? does this work
    ;; Source: https://github.com/joaotavora/eglot/discussions/1328#discussioncomment-7787866
 ;;    (defun eldoc-fancy (arg)
 ;;      "`eldoc' but uses the echo area by default and a prefix
 ;; will swap to a buffer."
 ;;      (interactive "P")
 ;;      (let ((eldoc-display-functions
 ;;             (if arg '(eldoc-display-in-buffer) '(eldoc-display-in-echo-area))))
 ;; 	(eldoc t)))


    (add-to-list 'display-buffer-alist
		 '("^\\*eldoc" display-buffer-at-bottom
		   (window-height . 4)))


    ;; use `eldoc-doc-buffer'
    ;; (setq eldoc-echo-area-prefer-doc-buffer t)
  
    ;; see https://github.com/joaotavora/eglot/discussions/734
    ;; (setq eldoc-echo-area-use-multiline-p nil)
    )

#+end_src
*** COMMENT eldoc-box
#+begin_src elisp
(use-package eldoc-box
  :ensure t
  :after eldoc
  :diminish
  :config
  )
#+end_src
*** COMMENT +My eglot-eldoc
Source: [[https://www.masteringemacs.org/article/seamlessly-merge-multiple-documentation-sources-eldoc][masteringemacs]]
#+begin_src elisp
(defun ph/eglot-eldoc ()
  (setq eldoc-documentation-strategy
        'eldoc-documentation-compose-eagerly))
#+end_src
