.emacs.d/init.org
*** eglot /(built-in)/
Part of core since Emacs 29, so no need to install.

janet-lsp
- continuously displays an error, which may be related to:
  - https://github.com/joaotavora/eglot/issues/597
  - becomes almost unusable due to small freezes

#+begin_src elisp
(use-package eglot
  ;; :hook ((eglot-managed-mode . ph/eglot-eldoc)) 
  :config
  (add-to-list 'eglot-server-programs
               '(janet-ts-mode . ("janet-lsp")))
  
  ;; (add-hook 'janet-ts-mode-hook 'eglot-ensure)

  ;; Disable documentation-on-hover, which is still accessible with `M-x
  ;; eldoc':
  ;; https://github.com/joaotavora/eglot/discussions/691#discussioncomment-719373
  ;; (add-hook 'eglot-managed-mode-hook
  ;; 	    (lambda () (eldoc-mode -1)))

  ;; (setq eglot-strict-mode nil)

  (add-to-list 'eglot-ignored-server-capabilities :hoverProvider)

  ;; (add-to-list 'eglot-ignored-server-capabilities :inlayHintProvider)
  ;; (add-to-list 'eglot-stay-out-of 'flymake)
  )

#+end_src
*** COMMENT lsp-mode
#+begin_src elisp
(use-package lsp-mode
  :ensure t
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (typescript-ts-mode . lsp)
         ;; if you want which-key integration
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

;; optionally
(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode)
;; (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
;; (use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

#+end_src
** Graphics
*** gnuplot
#+begin_src elisp
(use-package gnuplot
  :ensure t
  :init
  (autoload 'gnuplot-mode "gnuplot" "Gnuplot major mode" t)
  (autoload 'gnuplot-make-buffer "gnuplot" "open a buffer in gnuplot-mode" t)
  (add-to-list 'auto-mode-alist '("\\.gp$" . gnuplot-mode))
  ;;
  )
#+end_src
*** emacs-obsidian-excalidraw
**** local
#+begin_src elisp
(add-to-list 'load-path "~/Dev/emacs-obsidian-excalidraw")

(use-package emacs-obsidian-excalidraw
  :ensure nil
  :config
  (setq emacs-obsidian-excalidraw-vault "figures-excalidraw")
  (setq emacs-obsidian-excalidraw-vault-dir "~/Documents/Org-roam/figures-excalidraw")
  (setq emacs-obsidian-excalidraw-image-format "png")
  (setq emacs-obsidian-excalidraw-default-name "figure")
  (setq emacs-obsidian-excalidraw-relative-paths t)
  (setq emacs-obsidian-excalidraw-timestamp t)
  ;; you should enable correspond format auto export in excalidraw
;;
  )

#+end_src
**** COMMENT repo
#+begin_src elisp
(use-package emacs-obsidian-excalidraw
  :vc (:fetcher github :repo hsingko/emacs-obsidian-excalidraw)
  ;; :ensure t
  :config
  (setq emacs-obsidian-excalidraw-vault "figures-excalidraw")
  (setq emacs-obsidian-excalidraw-vault-dir "~/Documents/Org-roam/figures-excalidraw")
  (setq emacs-obsidian-excalidraw-image-format "png")
  (setq emacs-obsidian-excalidraw-default-name "figure")
  (setq emacs-obsidian-excalidraw-relative-paths t)
  (setq emacs-obsidian-excalidraw-timestamp t)
  ;; you should enable correspond format auto export in excalidraw
;;
  )

#+end_src
** Citations
**** [[#org-cite][org-cite (built-in)]]
**** citeproc
#+begin_src elisp
(use-package citeproc
  :ensure t
  ;;
  )
#+end_src
**** citar
#+begin_src elisp
(use-package citar
  :ensure t
  :after nerd-icons
  :custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography)
  (citar-open-entry-function #'citar-open-entry-in-zotero)
  ;; default is 'citar-open-entry-in-file'
  :hook
  (LaTeX-mode . citar-capf-setup)
  (org-mode . citar-capf-setup)
  :config
  (defvar citar-indicator-files-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-file_o"
	      :face 'nerd-icons-green
	      :v-adjust -0.1)
     :function #'citar-has-files
     :padding "  " ; need this because the default padding is too low for these icons
     :tag "has:files"))
  (defvar citar-indicator-links-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-link"
	      :face 'nerd-icons-orange
	      :v-adjust 0.01)
     :function #'citar-has-links
     :padding "  "
     :tag "has:links"))
  (defvar citar-indicator-notes-icons
    (citar-indicator-create
     :symbol (nerd-icons-codicon
	      "nf-cod-note"
	      :face 'nerd-icons-blue
	      :v-adjust -0.3)
     :function #'citar-has-notes
     :padding "    "
     :tag "has:notes"))
  (defvar citar-indicator-cited-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-circle_o"
	      :face 'nerd-icon-green)
     :function #'citar-is-cited
     :padding "  "
     :tag "is:cited"))

  (setq citar-indicators
	(list citar-indicator-files-icons
	      citar-indicator-links-icons
	      citar-indicator-notes-icons
	      citar-indicator-cited-icons)) 

  (setq citar-templates
	'((main . "${author editor:30%sn}     ${date year issued:4}     ${title:48}")
          (suffix . "          ${=key= id:15}    ${=type=:12}    ${tags keywords:*}")
          (preview . "${author editor:%etal} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.\n")
          (note . "Notes on ${author editor:%etal}, ${title}")))
  ;;
  )
#+end_src
**** citar-embark
#+begin_src elisp
(use-package citar-embark
  :ensure t
  :after citar embark
  :no-require
  ;; :bind
  ;; (("C-." . embark-act))
  :config (citar-embark-mode))

#+end_src
**** citar-org-roam
#+begin_src elisp
(use-package citar-org-roam
  :ensure t
  :after (citar org-roam)
  :config (citar-org-roam-mode))
#+end_src
** :lang Haskell
*** haskell-mode
#+begin_src elisp
(use-package haskell-mode
  :ensure t)

#+end_src
** :lang Lua
*** lua-mode
#+begin_src elisp
(use-package lua-mode
  :ensure t)

#+end_src

** :lang Clojure
*** cider
#+begin_src elisp
  (use-package cider
    :ensure t
    :config
    (require 'flycheck-clj-kondo)

    ;; For better editing in camelCase (Java names):
    (add-hook 'cider-repl-mode-hook #'subword-mode)

    ;; C-[ gets stuck because of Ciders ESC-key prefix, so let’s disable it:
  
    ;; (define-key cider-mode-map (kbd "ESC") nil)
    (setq cider-preferred-build-tool 'clojure-cli)

    ;; Use enrich-classpath for better Java lib completions/docs
    (setq cider-enrich-classpath t)  
  
    (setq cider-eval-spinner-type 'moon)
  
    (setq cider-repl-history-size 2000)

    ;; Don't show cider help text in repl after jack-in
    (setq cider-repl-display-help-banner nil)

    ;; Show error as overlay instead of the buffer (buffer is generated anyway
    ;; in case it's needed)
    (setq cider-show-error-buffer 'except-in-repl)
    ;; If we set `cider-show-error-buffer' to non-nil, focus error buffer when
    ;; error is thrown
    (setq cider-auto-select-error-buffer t)

    ;; Don't pop to the REPL buffer on connect
    ;; Create and display the buffer, but don't focus it.
    (setq cider-repl-pop-to-buffer-on-connect 'display-only)

    ;; skip host question on connect
    (defun cider--completing-read-host (hosts)
      '("localhost"))

    ;; cider window configuration
    (add-to-list
     'display-buffer-alist
     `("^\\*cider-repl.*\\*$"
       (display-buffer-reuse-window display-buffer-in-side-window)
       (side . bottom)
       (slot . 1)
       (window-height . 0.2)))

    (add-to-list
     'display-buffer-alist
     `("^\\*cider-error.*\\*$"
       (display-buffer-reuse-window display-buffer-in-side-window)
       (side . bottom)
       (slot . 2)
       (window-height . 0.2)))

    (add-to-list
     'display-buffer-alist
     `("^\\*cider-doc.*\\*$"
       (display-buffer-reuse-window display-buffer-in-side-window)
       (side . right)
       (slot . 1)
       (window-width . 0.3)))

    ;;
    )

#+end_src
*** babashka
#+begin_src elisp
(use-package babashka
  :ensure t)
#+end_src

*** COMMENT clj-refactor
#+begin_src elisp
  (use-package clj-refactor
    :ensure t
    :after cider
    :config
    ;; Hook function from https://github.com/clojure-emacs/clj-refactor.el
    (add-hook 'clojure-mode-hook
	      (lambda ()
		(clj-refactor-mode 1)
		(yas-minor-mode 1) ; for adding require/use/import statements
		;; This choice of keybinding leaves cider-macroexpand-1 unbound
		(cljr-add-keybindings-with-prefix "C-c C-m")))

    (dolist (magic-require '(("clerk"    . "nextjournal.clerk")
			     ("csv"      . "clojure.data.csv")
			     ("edn"      . "clojure.edn")
			     ("pprint"   . "clojure.pprint")
			     ("reagent"  . "reagent.core")
			     ("re-frame" . "re-frame.core")))
      (add-to-list 'cljr-magic-require-namespaces magic-require)))

#+end_src

