.emacs.d/init.el

(use-package eglot
  ;; :hook ((eglot-managed-mode . ph/eglot-eldoc)) 
  :config
  (add-to-list 'eglot-server-programs
               '(janet-ts-mode . ("janet-lsp")))
  
  ;; (add-hook 'janet-ts-mode-hook 'eglot-ensure)

  ;;; Disable documentation-on-hover, which is still accessible with `M-x
  ;;; eldoc':
  ;;; https://github.com/joaotavora/eglot/discussions/691#discussioncomment-719373
  (add-hook 'eglot-managed-mode-hook
	    (lambda () (eldoc-mode -1)))

  ;; (setq eglot-strict-mode nil)

  ;; (add-to-list 'eglot-ignored-server-capabilities :hoverProvider)

  ;; (add-to-list 'eglot-ignored-server-capabilities :inlayHintProvider)
  ;; (add-to-list 'eglot-stay-out-of 'flymake)
  )

(use-package gnuplot
  :ensure t
  :init
  (autoload 'gnuplot-mode "gnuplot" "Gnuplot major mode" t)
  (autoload 'gnuplot-make-buffer "gnuplot" "open a buffer in gnuplot-mode" t)
  (add-to-list 'auto-mode-alist '("\\.gp$" . gnuplot-mode))
  ;;
  )

(add-to-list 'load-path "~/Dev/emacs-obsidian-excalidraw")

(use-package emacs-obsidian-excalidraw
  :ensure nil
  :config
  (setq emacs-obsidian-excalidraw-vault "figures-excalidraw")
  (setq emacs-obsidian-excalidraw-vault-dir "~/Documents/Org-roam/figures-excalidraw")
  (setq emacs-obsidian-excalidraw-image-format "png")
  (setq emacs-obsidian-excalidraw-default-name "figure")
  (setq emacs-obsidian-excalidraw-relative-paths t)
  (setq emacs-obsidian-excalidraw-timestamp t)
  ;; you should enable correspond format auto export in excalidraw
;;
  )

(use-package citeproc
  :ensure t
  ;;
  )

(use-package citar
  :ensure t
  :after nerd-icons
  :custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography)
  (citar-open-entry-function #'citar-open-entry-in-zotero)
  ;; default is 'citar-open-entry-in-file'
  :hook
  (LaTeX-mode . citar-capf-setup)
  (org-mode . citar-capf-setup)
  :config
  (defvar citar-indicator-files-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-file_o"
	      :face 'nerd-icons-green
	      :v-adjust -0.1)
     :function #'citar-has-files
     :padding "  " ; need this because the default padding is too low for these icons
     :tag "has:files"))
  (defvar citar-indicator-links-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-link"
	      :face 'nerd-icons-orange
	      :v-adjust 0.01)
     :function #'citar-has-links
     :padding "  "
     :tag "has:links"))
  (defvar citar-indicator-notes-icons
    (citar-indicator-create
     :symbol (nerd-icons-codicon
	      "nf-cod-note"
	      :face 'nerd-icons-blue
	      :v-adjust -0.3)
     :function #'citar-has-notes
     :padding "    "
     :tag "has:notes"))
  (defvar citar-indicator-cited-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
	      "nf-fa-circle_o"
	      :face 'nerd-icon-green)
     :function #'citar-is-cited
     :padding "  "
     :tag "is:cited"))

  (setq citar-indicators
	(list citar-indicator-files-icons
	      citar-indicator-links-icons
	      citar-indicator-notes-icons
	      citar-indicator-cited-icons)) 

  (setq citar-templates
	'((main . "${author editor:30%sn}     ${date year issued:4}     ${title:48}")
          (suffix . "          ${=key= id:15}    ${=type=:12}    ${tags keywords:*}")
          (preview . "${author editor:%etal} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.\n")
          (note . "Notes on ${author editor:%etal}, ${title}")))
  ;;
  )

(use-package citar-embark
  :ensure t
  :after citar embark
  :no-require
  ;; :bind
  ;; (("C-." . embark-act))
  :config (citar-embark-mode))

(use-package citar-org-roam
  :ensure t
  :after (citar org-roam)
  :config (citar-org-roam-mode))

(use-package haskell-mode
  :ensure t)

(use-package lua-mode
  :ensure t)

  (use-package cider
    :ensure t
    :config
    (require 'flycheck-clj-kondo)

    ;;; For better editing in camelCase (Java names):
    (add-hook 'cider-repl-mode-hook #'subword-mode)

    ;;; C-[ gets stuck because of Ciders ESC-key prefix, so let’s disable it:
  
    ;;; (define-key cider-mode-map (kbd "ESC") nil)
    (setq cider-preferred-build-tool 'clojure-cli)

    ;;; Use enrich-classpath for better Java lib completions/docs
    (setq cider-enrich-classpath t)  
  
    (setq cider-eval-spinner-type 'moon)
  
    (setq cider-repl-history-size 2000)

    ;;; Don't show cider help text in repl after jack-in
    (setq cider-repl-display-help-banner nil)

    ;;; Show error as overlay instead of the buffer (buffer is generated anyway in
    ;;; case it's needed)
    (setq cider-show-error-buffer 'except-in-repl)
    ;;; If we set `cider-show-error-buffer' to non-nil, don't focus error buffer
    ;;; when error is thrown
    (setq cider-auto-select-error-buffer nil)

    ;; Don't pop to the REPL buffer on connect
    ;; Create and display the buffer, but don't focus it.
    (setq cider-repl-pop-to-buffer-on-connect 'display-only)

    ;;; skip host question on connect
    (defun cider--completing-read-host (hosts)
      '("localhost")))

  (use-package clj-refactor
    :ensure t
    :after cider
    :config
    ;;; Hook function from https://github.com/clojure-emacs/clj-refactor.el
    (add-hook 'clojure-mode-hook
	      (lambda ()
		(clj-refactor-mode 1)
		(yas-minor-mode 1) ; for adding require/use/import statements
		;; This choice of keybinding leaves cider-macroexpand-1 unbound
		(cljr-add-keybindings-with-prefix "C-c C-m")))

    (dolist (magic-require '(("clerk"    . "nextjournal.clerk")
			     ("csv"      . "clojure.data.csv")
			     ("edn"      . "clojure.edn")
			     ("pprint"   . "clojure.pprint")
			     ("reagent"  . "reagent.core")
			     ("re-frame" . "re-frame.core")))
      (add-to-list 'cljr-magic-require-namespaces magic-require)))

;; (defun clerk-show ()
;;   (interactive)
;;   (when-let
;;       ((filename
;;         (buffer-file-name)))
;;     (save-buffer)
