.emacs.d/init.org
*** +Clerk helper
Based on config from user 'dakra':
- https://github.com/nextjournal/clerk/issues/170#issuecomment-1257013793
  
#+begin_src elisp

(defun ph/clerk-show ()
  (interactive)
  (when-let
      ((filename
        (buffer-file-name)))
    (save-buffer)
    (cider-interactive-eval
     (concat "(nextjournal.clerk/show! \"" filename "\")"))))


;; The following variables may be overwritten per project in .dir-locals

(defvar ph/clerk-watch-paths '("notebooks" "src")
  "Watch paths for Clerk notebooks.")

(defvar ph/clerk-serve-port "7777"
  "Port for serving Clerk notebooks.")

(defvar ph/clerk-nrepl-port "1339"
  "Port for Clerk’s render nREPL server.")


(defun ph/--clerk-serve (port browse? render-nrepl?)
  (let ((watch-paths (concat "[" (mapconcat (lambda (s) (concat "\"" s "\""))
					    ph/clerk-watch-paths " ") "]")))
    (cider-interactive-eval
     (concat
      "(nextjournal.clerk/serve! {"
      (if render-nrepl?
	  (concat ":render-nrepl {:port " ph/clerk-nrepl-port "} ") "")
      ":watch-paths " watch-paths " "
      ":port " port " "
      ":browse? " (if browse? "true" "false") "})"))))


(defun ph/clerk-serve-in-emacs ()
  "Serve clerk notebooks and browse in Emacs."
  (interactive)
  (let ((port ph/clerk-serve-port))
    (if (y-or-n-p "Launch render nREPL?")
	(ph/--clerk-serve port nil t)
      (ph/--clerk-serve port nil nil))
    (ph/browse-url-in-split-window (concat "http://localhost:" port))))

(defun ph/clerk-serve ()
  "Serve clerk notebooks."
  (interactive)
  (let ((render-nrepl? (y-or-n-p "Launch render nREPL?"))
	(browse? (y-or-n-p "Open in default browser?")))
    (ph/--clerk-serve ph/clerk-serve-port browse? render-nrepl?)))


(defun ph/clerk-build ()
  "Build static html for the current clerk notebook."
  (interactive)
  (message "Building static page")
  (when-let ((filename (buffer-file-name)))
    (let ((root (project-root (project-current t))))
      (cider-interactive-eval
       (concat "(nextjournal.clerk/build! {:paths [\""
               (file-relative-name filename root) "\"]})")))))

(defun ph/clerk-show ()
  "Show buffer in clerk."
  (interactive)
  (message "Show buffer in clerk.")
  (when-let ((filename (buffer-file-name)))
    (cider-interactive-eval
     (concat "(nextjournal.clerk/show! \"" filename "\")"))))

(defun ph/clerk-save-and-show ()
  "Save buffer and show in clerk."
  (interactive)
  (save-buffer)
  (ph/clerk-show))


(keymap-set clojure-mode-map "M-RET" #'ph/clerk-show)
(keymap-set clojure-mode-map "C-c j" #'ph/clerk-serve)

#+end_src
**** COMMENT Clerk minor-mode
Not needed, since I just use ~ph/clerk-show~ from ~clojure-mode-map~, which
is more flexible when notebooks are not in a =notebook= directory.

#+begin_src elisp
(define-minor-mode clerk-mode
  "A mode that just binds `<M-return>' to `clerk-show'."
  :lighter " clerk"
  :keymap `((,(kbd "<M-return>") . ph/clerk-save-and-show))
  (if clerk-mode
      (add-hook 'after-save-hook #'ph/clerk-show 100 t)
    (remove-hook 'after-save-hook #'ph/clerk-show t)))


(defun ph/buffer-file-parent-dir-name ()
  (interactive)
  (file-name-nondirectory
   (directory-file-name (file-name-directory buffer-file-name))))

(defun ph/activate-hook-for-dir (mode dir-name)
  "Activate `mode` if the directory in which the file resides has `dir-name`."
  (when (string-match-p dir-name (ph/buffer-file-parent-dir-name))
    (funcall mode)))

(add-hook 'find-file-hook
	  (lambda ()
	    (ph/activate-hook-for-dir 'clerk-mode "notebooks")))
#+end_src

** :lang Scheme
*** geiser
#+begin_src elisp
(use-package geiser-chicken
  :ensure t
  :config
  (setq geiser-default-implementation 'chicken))
#+end_src
*** racket-mode
#+begin_src elisp
(use-package racket-mode
  :ensure t
  :config
  (setq racket-program "/opt/homebrew/bin/racket")
  (add-to-list 'display-buffer-alist
	       '("\\*Racket REPL.+"
		 (display-buffer-in-side-window)
		 (side . right)
		 (window-width . 0.5))))
#+end_src

** :lang Common Lisp
*** SLIME
See https://github.com/roswell/roswell/wiki/Initial-Recommended-Setup

#+begin_src elisp
(load (expand-file-name "~/.roswell/helper.el"))
(setq inferior-lisp-program "ros -Q run")

;; (use-package ???
;;   :ensure t
;;   :config
;;   ;;
;;   )
#+end_src
** :lang Janet
*** janet-ts-mode
#+begin_src elisp
(use-package janet-ts-mode
  ;; :ensure t
  :vc (:fetcher github :repo sogaiu/janet-ts-mode))

#+end_src
*** ajrepl
#+begin_src elisp
(use-package ajrepl
  ;; :ensure t
  :after janet-ts-mode
  :vc (:fetcher github :repo sogaiu/ajrepl)
  :config
  (add-hook 'janet-ts-mode-hook
            #'ajrepl-interaction-mode))

#+end_src
*** COMMENT a-janet-spork-client
Janet Spork Netrepl client.
- [[https://github.com/sogaiu/a-janet-spork-client/blob/master/ajsc.el][Instructions]]
- needs [[https://github.com/janet-lang/spork][Spork]] utility library: ~sudo jpm install spork~
- there is also [[https://github.com/sogaiu/snr][snr]] (which I haven’t tested)

1. in console, call:
   : janet -e '(import spork/netrepl) (netrepl/server)'
   (or create/use ~janetrepl~ alias)
2. ~M-x ajsc~ to connect to the nrepl server with specified port

#+begin_src elisp
(use-package ajsc
  :ensure t
  :after (janet-ts-mode ajrepl)
  :vc (:fetcher github :repo sogaiu/a-janet-spork-client)
  :config
  (add-hook 'janet-ts-mode-hook
            #'ajsc-interaction-mode))
#+end_src
** :lang markdown
*** COMMENT markdown-mode
*NOTE:* had to disable this due to eglot throwing errors when parsing
 comment forms in javascript with treesit grammar!
#+begin_src elisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "pandoc")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do))
  :config
  (setq markdown-fontify-code-blocks-natively t)
  (dolist (x '(("clj" . clojure-mode)
               ("cljs" . clojure-mode)
               ("cljc" . clojure-mode)))
    (add-to-list 'markdown-code-lang-modes x)))
#+end_src
*** COMMENT separedit
#+begin_src elisp
(use-package separedit
  :ensure t
  :after markdown-mode
  ;; :init
  :config
  ;; Default major-mode for edit buffer
  ;; can also be other mode e.g. ‘org-mode’.
  (setq separedit-default-mode 'markdown-mode)
  
  ;; Key binding for modes you want edit
  ;; or simply bind ‘global-map’ for all.
  (define-key prog-mode-map        (kbd "C-c '") #'separedit)
  (define-key minibuffer-local-map (kbd "C-c '") #'separedit)
  (define-key help-mode-map        (kbd "C-c '") #'separedit)
  (define-key helpful-mode-map     (kbd "C-c '") #'separedit)
  (define-key clojure-mode-map     (kbd "C-c '") #'separedit)

  ;; Feature options
  ;; (setq separedit-preserve-string-indentation t)
  ;; (setq separedit-continue-fill-column t)
  ;; (setq separedit-write-file-when-execute-save t)
  ;; (setq separedit-remove-trailing-spaces-in-comment t)
  )
#+end_src
** :lang Logo
*** COMMENT logo-mode
Works kind-of, but with multiple issues.
- see: https://www.emacswiki.org/emacs/LogoMode
- overrides Emacs font face/color configs
#+begin_src elisp
(use-package logo-mode
  :ensure t
  :vc (:fetcher github :repo brianharvey/UCBLogo
		;; How to specify source files?
		;; :files ("source/emacs/*" "source/helpfiles/*" "source/docs/*")
		))

#+end_src
** COMMENT :lang JavaScript
#+begin_src elisp
(use-package js
  :config
  (add-to-list 'auto-mode-alist '("\\.js$" . javascript-mode))  
  ;;
  )

#+end_src
** COMMENT :lang TypeScript
#+begin_src elisp
(use-package typescript-ts-mode
  :mode (("\\.ts\\'" . typescript-ts-mode)
	 ("\\.tsx\\'" . tsx-ts-mode))
  :config
  (add-hook! '(typescript-ts-mode-hook tsx-ts-mode-hook) #'lsp!))
#+end_src
** COMMENT :lang CSS
#+begin_src elisp
(use-package css-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.css$" . css-mode))  
  ;;
  )


#+end_src
** Themes
*** gruvbox-theme
#+begin_src elisp
(use-package gruvbox-theme
  :ensure t)
#+end_src

*** modus-themes /(built-in → updated)/
Replacing the built-in version (3.0.0) with the current one.

Notes:
- unfortunately, ~modus-themes-mixed-fonts~ causes OrgMode to lag when
  moving the point quickly, so I have to set it to ~nil~ for now…

#+begin_src elisp
(use-package modus-themes
  :ensure t
  :pin elpa
  :config

  
  (setq modus-themes-italic-constructs t
	modus-themes-bold-constructs t
	modus-themes-mixed-fonts nil

	;; modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted)

	modus-themes-completions
	'((matches . (regular normal))
          (selection . (semibold normal)))
	)

  ;; I set this global because the `cursor' face may get changed dynamically
  ;; and this allows me to keep its original value for future reference
  (setq ph/cursor-bg "#00d599")

  (setq modus-themes-common-palette-overrides
        `(
	  ;; Mode line: appear borderless (border = bg color)
	  (border-mode-line-active bg-mode-line-active)
          (border-mode-line-inactive bg-mode-line-inactive)

	  ;; Mode line: sage background
	  (bg-mode-line-active bg-sage)
          (fg-mode-line-active fg-main)
          (border-mode-line-active bg-green-intense)

	  ;; Links: subtle underlines
	  (underline-link border)
          (underline-link-visited border)
          (underline-link-symbolic border)	

	  (bg-paren-match bg-hover)
	  (underline-paren-match fg-main)

	  (bg-prose-block-contents bg-dim)
	  
          (fg-line-number-active "gray50")
          (bg-line-number-active bg-inactive)
          ;;
          ))

  (setq modus-operandi-tinted-palette-overrides
	`(;; General
	  ;; (bg-hl-line bg-green-nuanced)
	  (bg-main "#faf8f4") ; fbf8f3
	  (bg-hl-line "#ffffff")
	  (fg-dim "#9a9693") ; #a9a19b
	  (bg-dim "#f3efe6") ; #f4f0e7
          (bg-hover "#c3f5e7")
	  (bg-region "#ece9e5")
	  (bg-search-lazy bg-hover)

	  ;; Syntax
	  (comment fg-dim)
          (string yellow-cooler)
          (docstring "#87786e")
          (keyword cyan-intense)
          ;; (keyword green-intense)
          (fnname blue)
          (variable magenta-warmer)
          (constant green)
          (identifier yellow-cooler)
          (builtin magenta)
          (type red)
          
	  (cursor ,ph/cursor-bg)
          (bg-search-current bg-yellow-subtle)
          
          ;; Org-mode
	  (fg-prose-code magenta-warmer)
	  (fg-prose-verbatim magenta-cooler)
	  ;; (fg-prose-code cyan-intense)
          (fg-heading-0 yellow)
          (fg-heading-1 cyan-intense)
          (fg-heading-2 cyan)
          (fg-heading-3 cyan-warmer)
          (fg-heading-4 blue)
          (fg-heading-5 blue-warmer)
          (fg-heading-6 fg-alt)
          (fg-heading-7 fg-dim)
          (fg-heading-8 fg-main)
          ;;
	  ))
  
  )
#+end_src

*** ef-themes
#+begin_src elisp
(use-package ef-themes
  :ensure t)
#+end_src
** server /(built-in)/
Evaluate forms from terminal, e.g.:
: emacsclient -e '(print "Hello from Emacs!")'

#+begin_src elisp
(use-package server
  :ensure nil
  :defer 1
  :config
  (unless (server-running-p)
    (server-start)))
#+end_src

* Customization
** Modifier keys
#+begin_src elisp
(setq mac-command-modifier 'meta)          ;; left cmd = right cmd
(setq mac-right-command-modifier 'left)
(setq mac-option-modifier nil)             ;; keeps Umlauts, etc. accessible
(setq mac-right-option-modifier 'left)
(setq mac-control-modifier 'hyper)         ;; in case hyper is needed
(setq mac-right-control-modifier 'control) ;; also works for caps-lock as ctrl

#+end_src

** Text editing
