.emacs.d/init.el
;;     (cider-interactive-eval
;;      (concat "(nextjournal.clerk/show! \"" filename "\")"))))

;; (define-key clojure-mode-map (kbd "<M-return>") 'clerk-show)


;; Thanks to user 'dakra' for sharing this config:
;; - https://github.com/nextjournal/clerk/issues/170#issuecomment-1257013793

;; Shortcut for clerk/show
(defun clerk-serve ()
  "Serve clerk notebooks."
  (interactive)
  (let ((port "7777"))
    (cider-interactive-eval (concat
			     "(nextjournal.clerk/serve! {"
			     ":port " port " "
			     ":browse? false})"))
    (ph/browse-url-in-split-window (concat "http://localhost:" port))))

(defun clerk-build ()
  "Build static html for the current clerk notebook."
  (interactive)
  (message "Building static page")
  (when-let ((filename (buffer-file-name)))
    (let ((root (project-root (project-current t))))
      (cider-interactive-eval
       (concat "(nextjournal.clerk/build! {:paths [\""
               (file-relative-name filename root) "\"]})")))))

(defun clerk-show ()
  "Show buffer in clerk."
  (interactive)
  (message "Show buffer in clerk.")
  (when-let ((filename (buffer-file-name)))
    (cider-interactive-eval
     (concat "(nextjournal.clerk/show! \"" filename "\")"))))

(defun clerk-save-and-show ()
  "Save buffer and show in clerk."
  (interactive)
  (save-buffer)
  (clerk-show))

(define-minor-mode clerk-mode
  "A mode that just binds `<M-return>' to `clerk-show'."
  :lighter " clerk"
  :keymap `((,(kbd "<M-return>") . clerk-save-and-show))
  (if clerk-mode
      (add-hook 'after-save-hook #'clerk-show 100 t)
    (remove-hook 'after-save-hook #'clerk-show t)))


(defun ph/buffer-file-parent-dir-name ()
  (interactive)
  (file-name-nondirectory
   (directory-file-name (file-name-directory buffer-file-name))))

(defun activate-hook-for-dir (mode dir-name)
  "Activate `mode` if the directory in which the file resides has `dir-name`."
  (when (string-match-p dir-name (ph/buffer-file-parent-dir-name))
    (funcall mode)))

(add-hook 'find-file-hook
	  (lambda ()
	    (activate-hook-for-dir 'clerk-mode "notebooks")))

(use-package geiser-chicken
  :ensure t
  :config
  (setq geiser-default-implementation 'chicken))

(use-package racket-mode
  :ensure t
  :config
  (setq racket-program "/opt/homebrew/bin/racket")
  (add-to-list 'display-buffer-alist
	       '("\\*Racket REPL.+"
		 (display-buffer-in-side-window)
		 (side . right)
		 (window-width . 0.5))))

(use-package janet-ts-mode
  :vc (:fetcher github :repo sogaiu/janet-ts-mode)
  :ensure t)

(use-package ajrepl
  :ensure t
  :after janet-ts-mode
  :vc (:fetcher github :repo sogaiu/ajrepl)
  :config
  (add-hook 'janet-ts-mode-hook
            #'ajrepl-interaction-mode))

(use-package ajsc
  :ensure t
  :after (janet-ts-mode ajrepl)
  :vc (:fetcher github :repo sogaiu/a-janet-spork-client)
  :config
  (add-hook 'janet-ts-mode-hook
            #'ajsc-interaction-mode))

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "pandoc")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do))
  :config
  (setq markdown-fontify-code-blocks-natively t)
  (dolist (x '(("clj" . clojure-mode)
               ("cljs" . clojure-mode)
               ("cljc" . clojure-mode)))
    (add-to-list 'markdown-code-lang-modes x)))

(use-package js
  :config
  (add-to-list 'auto-mode-alist '("\\.js$" . javascript-mode))  
  ;;
  )

(use-package css-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.css$" . css-mode))  
  ;;
  )

(setq mac-command-modifier 'meta)          ;; left cmd = right cmd
(setq mac-right-command-modifier 'left)
(setq mac-option-modifier nil)             ;; keeps Umlauts, etc. accessible
(setq mac-right-option-modifier 'left)
(setq mac-control-modifier 'hyper)         ;; in case hyper is needed
(setq mac-right-control-modifier 'control) ;; also works for caps-lock as ctrl
