.emacs.d/init.org
*** lines
#+begin_src elisp
(defun ph/newline-below ()
  "Always inserts a newline below the point."
  (interactive)
  (save-excursion
    (move-end-of-line nil)
    (open-line 1)))

(defun ph/newline-above ()
  "Always inserts a newline above the point."
  (interactive)
  (if (bolp)
      (newline)
      (save-excursion
	(beginning-of-line)
	(newline))))

;; (defun ph/newline-empty-above ()
;;   "Always inserts a newline above the point."
;;   (interactive)
;;   (let ((beg (point)))
;;     (back-to-indentation)
;;     (newline)
;;     (goto-char beg)))

(keymap-global-set "C-}" #'ph/newline-below)
(keymap-global-set "C-{" #'ph/newline-above)


(defun ph/join-with-next-line ()
  "Join the current line with the line after it."
  (interactive)
  (join-line -1))


(defun ph/kill-whole-line-move-prev ()
  "Deletes the current line and moves point back to end of previous line."
  (interactive)
  (kill-whole-line)
  (move-end-of-line 0))

;; UPDATE: I don’t use the following bindings anymore, because of meow

;; Feels more like Vims S-j to me and I use this very often:
;; (note: C-j gets overwritten in Lisp Interactive mode)
;; (keymap-global-set "C-M-j" #'delete-indentation) ;; M-^ is weird to type
;; (keymap-global-set "C-S-j" #'ph/join-with-next-line) ; ? or C-c j

;; I don’t use these often enough for their prominent keybindings:
;; (keymap-global-set "M-o" #'default-indent-new-line) ;; was C-M-j / M-j
;; (keymap-global-set "M-j" #'electric-newline-and-maybe-indent) ;; was C-j

;; Copied from source: https://www.emacswiki.org/emacs/UnwrapLine
(defun ph/unwrap-line ()
  "Remove all newlines until we get to two consecutive ones.
    Or until we reach the end of the buffer."
  (interactive)
  (let ((start (point))
	(end (copy-marker (or (search-forward "\n\n" nil t)
			      (point-max))))
	(fill-column (point-max)))
    (fill-region start end)
    ;; (goto-char end)
    ;; (newline)
    ;; (goto-char start)
    ))

(keymap-global-set "C-c q" #'ph/unwrap-line)

;; WIP: should unwrap a whole region
(defun ph/unwrap-region ()
  (interactive)
  nil)
#+end_src

*** regions
#+begin_src elisp
(defun ph/wrap-with-char (start end)
  "Wraps a region with given input character."
  (interactive "r")
  (let ((char (string-to-char (read-string "Enter character: "))))
    (save-excursion
      (goto-char end)
      (insert-char char)
      (goto-char start)
      (insert-char char))))

(defun ph/change-wrapped-char (start end)
  "Changes wrapping characters in a region with given input character."
  (interactive "r")
  (let ((char (let ((input (read-string "Enter character: ")))
		(unless (string-blank-p input)
		  (string-to-char input)))))
    (save-excursion
      (goto-char end)
      (delete-char -1)
      (when char (insert-char char))
      (goto-char start)
      (delete-char 1)
      (when char (insert-char char)))))

(defun ph/remove-surrounding (start end)
  "Removes surrounding characters in a region."
  (interactive "r")
  (save-excursion
    (goto-char end)
    (delete-char -1)
    (goto-char start)
    (delete-char 1)))


#+end_src

*** insertions
#+begin_src elisp
(defun ph/insert-date ()
  "Insert current date."
  (interactive)
  (insert (format-time-string "%Y-%m-%d")))

#+end_src
** Wrap with char
** Shells & Terminals
shell-mode:
#+begin_src elisp
;; TODO: bind to local key
(defun ph/comint-kill-output ()
  "In shell-mode, kills output instead of deleting, as in
comint-delete-output by default (C-c C-o)."
  (interactive)
  (comint-delete-output t))
#+end_src

eshell:
#+begin_src elisp
(setq eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      ; eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      ; eshell-destroy-buffer-when-process-dies t  ;; WARNING: see variable info
      ; eshell-visual-commands'("bash" "htop" "ssh" "top" "zsh")
      )
#+end_src

** Colors

Find nearest color
Source: https://www.masteringemacs.org/article/find-nearest-colors-emacs-24
#+begin_src elisp
(defun ph/find-nearest-color (color &optional use-hsv)
  "Finds the nearest color by RGB distance to COLOR.

If called with a universal argument (or if USE-HSV is set) use HSV instead of RGB.
Runs \\[list-colors-display] after setting `list-colors-sort'"
  (interactive "sColor: \nP")
  (let ((list-colors-sort `(,(if (or use-hsv current-prefix-arg)
                                 'hsv-dist
                               'rgb-dist) . ,color)))
    (if (color-defined-p color)
        (list-colors-display)
      (error "The color \"%s\" does not exist." color))))

(defun ph/find-nearest-color-at-point (pt)
  "Finds the nearest color at point PT.

If called interactively, PT is the value immediately under `point'."
  (interactive "d")
  (ph/find-nearest-color (with-syntax-table (copy-syntax-table (syntax-table))
                           ;; turn `#' into a word constituent to help
                           ;; `thing-at-point' find HTML color codes.
                           (modify-syntax-entry ?# "w")
                           (thing-at-point 'word))))
#+end_src

** Windows
#+begin_src elisp
;; (defun window-full ()
;;   (interactive)
;;   (enlarge-window 1))

;; inspired from https://www.masteringemacs.org/article/my-emacs-keybindings
(keymap-global-set "M-o" #'other-window)
;; get rid of the annoying frame minimize command
(keymap-global-set "C-z" nil) 

;; (keymap-global-set "C-J" #'shrink-window-horizontally)
;; (keymap-global-set "C-L" #'enlarge-window-horizontally)
;; (keymap-global-set "C-I" #'enlarge-window)
;; (keymap-global-set "C-K" #'shrink-window)
#+end_src

** Dired
#+begin_src elisp
;; Source: https://gist.github.com/rmuslimov/72bf5a1561c7b60eb535
(setq
 ph/scripts-dired-reveal-in-finder
 "tell application \"Finder\"
  reveal POSIX file \"%s\"
  activate
end tell")

(defun ph/dired-reveal-in-finder ()
  "In Dired, reveal the location of the file/directory under cursor in Finder."
  (interactive)
  (let* ((filename (dired-get-file-for-visit))
         (cmd (format ph/scripts-dired-reveal-in-finder filename)))
    (do-applescript cmd)))

(keymap-set dired-mode-map "r" #'ph/dired-reveal-in-finder)

(defun ph/dired-open-in-finder ()
  "In Dired, open the file/directory under the cursor in Finder."
  (interactive)
  (let ((file-name (dired-get-file-for-visit)))
    (if (file-exists-p file-name)
        (shell-command (concat "open" " " file-name))
      (message "File does not exist!"))))

(keymap-set dired-mode-map "O" #'ph/dired-open-in-finder)
#+end_src

** COMMENT Popup windows & Help buffers
? not needed anymore due to popwin, maybe delete
#+begin_src elisp
(defun ph/close-all-popups ()
  "Closes all open popup windows."
  (interactive)
  (dolist (window (window-list))
    (when (window-parameter window 'popup)
      (delete-window window))))

(defun ph/kill-all-help-buffers ()
  "Closes all open help buffers."
  (interactive)
  (let ((buffers (cl-remove-if-not
                  (lambda (b) (string-prefix-p "*Help" (buffer-name b) t))
                  (buffer-list))))
    (dolist (buf buffers)
      (when (buffer-live-p buf)
        (when (get-buffer-window buf)
          ;; Delete window if more than one window is open
          (when (> (length (window-list)) 1)
            (delete-window (get-buffer-window buf))))
        (kill-buffer buf)))))

;; (keymap-global-set "C-`" #'ph/kill-all-help-buffers)
#+end_src

** Commands in Popup frames
Thanks to Protesilaos Stavrou for this snippet.
- Source: [[https://protesilaos.com/codelog/2024-09-19-emacs-command-popup-frame-emacsclient/][Emacs: commands in popup frames with 'emacsclient']]

#+begin_src elisp
;; Run commands in a popup frame

(defun prot-window-delete-popup-frame (&rest _)
  "Kill selected selected frame if it has parameter `prot-window-popup-frame'.
Use this function via a hook."
  (when (frame-parameter nil 'prot-window-popup-frame)
    (delete-frame)))

(defmacro prot-window-define-with-popup-frame (command)
  "Define interactive function which calls COMMAND in a new frame.
Make the new frame have the `prot-window-popup-frame' parameter."
  `(defun ,(intern (format "prot-window-popup-%s" command)) ()
     ,(format "Run `%s' in a popup frame with `prot-window-popup-frame' parameter.
Also see `prot-window-delete-popup-frame'." command)
     (interactive)
     (let ((frame (make-frame '((prot-window-popup-frame . t)))))
       (select-frame frame)
       (switch-to-buffer " prot-window-hidden-buffer-for-popup-frame")
       (condition-case nil
           (call-interactively ',command)
         ((quit error user-error)
          (delete-frame frame))))))

#+end_src

*** Calc popup command
#+begin_src elisp
(prot-window-define-with-popup-frame full-calc)

;; (add-hook 'calc-end-hook #'prot-window-delete-popup-frame)

(advice-add #'calc-quit :around
	    (lambda (fn &rest args)
	      (if (frame-parameter nil 'prot-window-popup-frame)
		  (delete-frame)
		(apply fn args))))
#+end_src

*** COMMENT Examples
#+begin_src elisp
(declare-function org-capture "org-capture" (&optional goto keys))
(defvar org-capture-after-finalize-hook)

;;;###autoload (autoload 'prot-window-popup-org-capture "prot-window")
(prot-window-define-with-popup-frame org-capture)

(add-hook 'org-capture-after-finalize-hook #'prot-window-delete-popup-frame)

(declare-function tmr "tmr" (time &optional description acknowledgep))
(defvar tmr-timer-created-functions)

;;;###autoload (autoload 'prot-window-popup-tmr "prot-window")
(prot-window-define-with-popup-frame tmr)

(add-hook 'tmr-timer-created-functions #'prot-window-delete-popup-frame)

;; The emacsclient call depends on the daemon or `server-mode' (I use the latter)

;; The emacsclient calls that need ot be bound to system-wide keys

;; emacsclient -e '(prot-window-popup-org-capture)'
;; emacsclient -e '(prot-window-popup-tmr)'

#+end_src

