.emacs.d/init.org
** xwidget-webkit
#+begin_src elisp
(add-hook 'xwidget-webkit-mode-hook
	  (lambda ()
	    (display-line-numbers-mode 0)))

(defun ph/browse-url-in-split-window (url)
  (interactive "sEnter URL: ")
  (let ((buffer (generate-new-buffer "+xwidget-webkit*")))
    (set-frame-size nil 210 (frame-height))
    (split-window-right)
    (other-window 1)
    (let* ((pixel-size 980)
	   (desired-char-width (/ pixel-size (frame-char-width)))
	   (delta (- desired-char-width (window-total-width))))
      (when (> delta 0)
	(window-resize nil delta t))
      (switch-to-buffer buffer)
      ;; (setq window-size-fixed 'width)
      (xwidget-webkit-browse-url url))))

(defun ph/set-frame-size-xwidget-webkit-split ()
  (interactive)
  (set-frame-size nil 210 (frame-height)))


#+end_src

** Misc
Increment/decrement numbers like in Vim:
- see https://www.emacswiki.org/emacs/IncrementNumber
#+begin_src elisp
(defun ph/change-number-at-point (change increment)
  (let ((number (number-at-point))
        (point (point)))
    (when number
      (progn
        (forward-word)
        (search-backward (number-to-string number))
        (replace-match (number-to-string (funcall change number increment)))
        (goto-char point)))))

(defun ph/increment-number-at-point (&optional increment)
  "Increment number at point like vim's C-a"
  (interactive "p")
  (ph/change-number-at-point '+ (or increment 1)))

(defun ph/decrement-number-at-point (&optional increment)
  "Decrement number at point like vim's C-x"
  (interactive "p")
  (ph/change-number-at-point '- (or increment 1)))

(keymap-global-set "C-c +" #'ph/increment-number-at-point)
(keymap-global-set "C-c -" #'ph/decrement-number-at-point)

(defun ph/macos-open (path)
  "Open `path' using the built-in `open' command from MacOS."
  (shell-command (concat "open " path)))

#+end_src

* Appearance
** COMMENT Fonts (old)

#+begin_src elisp
(set-face-attribute 'default nil
                    :font "Berkeley Mono"
                    ;; :font "BerkeleyMono Nerd Font Mono"
                    :height 130 ;; was 130 / 12 pt
                    :weight 'regular)

(set-face-attribute 'variable-pitch nil
                    :font "Cambria"
                    :height 120
                    :weight 'regular)

(set-face-attribute 'fixed-pitch nil
                    :font "Berkeley Mono"
                    ;; :font "BerkeleyMono Nerd Font Mono"
                    :height 130 ;; was 130
                    :weight 'regular)

(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)

(set-face-attribute 'font-lock-keyword-face nil
                    :slant 'normal)

;; (setq-default line-spacing 0.12)

#+end_src

** Fonts (new)
Notes:
- /TX-02/ is the new family name for /Berkeley Mono/ (now v2)
- unfortunately, Emacs doesn’t support all its weights and widths (probably
  because of its simplified font model?)

#+begin_src elisp
(set-face-attribute 'default nil
		    :family "TX-02"
		    ;; height = point size * 10
		    :height 140
		    :weight 'Regular
		    :width 'SemiCondensed)

(set-face-attribute 'variable-pitch nil
		    :font "Cambria"
		    :height 160
		    :weight 'regular)

(set-face-attribute 'fixed-pitch nil
		    :family "TX-02"
		    ;; height = point size * 10
		    :height 140
		    :weight 'Regular
		    :width 'SemiCondensed)

(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)

(set-face-attribute 'font-lock-keyword-face nil
                    :slant 'normal)

;; (setq-default line-spacing 0.12)

#+end_src

** Themes
#+begin_src elisp
(add-to-list 'custom-theme-load-path (concat user-emacs-directory "themes"))

(defun load-only-theme ()
  "Disable all themes and then load a single theme interactively."
  (interactive)
  (while custom-enabled-themes
    (disable-theme (car custom-enabled-themes)))
  (call-interactively 'load-theme))
;; credits: user bakuretsu on reddit
;; source: https://www.reddit.com/r/emacs/comments/30b67j/comment/cpr8bsn/


;; to prevent Emacs from enabling all required themes on startup:
(mapc #'disable-theme custom-enabled-themes)

;; (load-theme 'modus-operandi t)

;; Activate my desired themes
;; (load-theme 'modus-operandi t t)
;; (load-theme 'modus-vivendi t t)
(load-theme 'modus-operandi-tinted t t)
(load-theme 'modus-vivendi-tinted t t)

;; Enable my preferred theme
;; (enable-theme 'modus-operandi)
(enable-theme 'modus-operandi-tinted)

;; Enable if I want to use proportional fonts in text modes:
;; (add-hook 'text-mode-hook #'variable-pitch-mode)
#+end_src

*** COMMENT pmacs
#+begin_src elisp
(load-theme 'pmacs t)

(set-face-attribute
 'org-transclusion-fringe nil
 :foreground "#83be9d"
 ;; :background "#494a63"
 )

(set-face-attribute
 'org-transclusion-source-fringe nil
 :foreground "#83be9d"
 ;; :background "#494a63"
 )

(set-face-attribute
 'org-transclusion nil
 ;; :foreground "#83be9d"
 :background "#2d3c33"
 )

(set-face-attribute
 'org-transclusion-source nil
 ;; :foreground "#83be9d"
 :background "#2d3c33"
 )

#+end_src

** Faces
#+begin_src elisp

(defface ph/cursor--copy
  `((t (:background ,ph/cursor-bg)))
  "Copy of the `cursor' face, in case it changed.")

(set-face-attribute 'ph/meow-calc-cursor nil
		    :background "#00caee") ; #83be9d

(let ((faces '(meow-beacon-cursor
	       meow-insert-cursor
	       meow-keypad-cursor
	       meow-kmacro-cursor
	       meow-motion-cursor
	       meow-normal-cursor
	       meow-unknown-cursor)))
  (dolist (face faces)
    (set-face-attribute face nil :inherit 'ph/cursor--copy)))


;; (set-face-attribute
;;  'org-transclusion-fringe nil
;;  :foreground "#83be9d"
;;  ;; :background "#494a63"
;;  )

;; (set-face-attribute
;;  'org-transclusion-source-fringe nil
;;  :foreground "#83be9d"
;;  ;; :background "#494a63"
;;  )

;; (set-face-attribute
;;  'org-transclusion nil
;;  ;; :foreground "#83be9d"
;;  :background "#2d3c33"
;;  )

;; (set-face-attribute
;;  'org-transclusion-source nil
;;  ;; :foreground "#83be9d"
;;  :background "#2d3c33"
;;  )
#+end_src

