.emacs.d/init.el

(add-hook 'xwidget-webkit-mode-hook
	  (lambda ()
	    (display-line-numbers-mode 0)))

(defun ph/browse-url-in-split-window (url)
  (interactive "sEnter URL: ")
  (let ((buffer (generate-new-buffer "+xwidget-webkit*")))
    (set-frame-size nil 210 (frame-height))
    (split-window-right)
    (other-window 1)
    (let* ((pixel-size 980)
	   (desired-char-width (/ pixel-size (frame-char-width)))
	   (delta (- desired-char-width (window-total-width))))
      (when (> delta 0)
	(window-resize nil delta t))
      (switch-to-buffer buffer)
      ;; (setq window-size-fixed 'width)
      (xwidget-webkit-browse-url url))))

(defun ph/set-frame-size-xwidget-webkit-split ()
  (interactive)
  (set-frame-size nil 210 (frame-height)))

(defun ph/change-number-at-point (change increment)
  (let ((number (number-at-point))
        (point (point)))
    (when number
      (progn
        (forward-word)
        (search-backward (number-to-string number))
        (replace-match (number-to-string (funcall change number increment)))
        (goto-char point)))))

(defun ph/increment-number-at-point (&optional increment)
  "Increment number at point like vim's C-a"
  (interactive "p")
  (ph/change-number-at-point '+ (or increment 1)))

(defun ph/decrement-number-at-point (&optional increment)
  "Decrement number at point like vim's C-x"
  (interactive "p")
  (ph/change-number-at-point '- (or increment 1)))

(keymap-global-set "C-c +" #'ph/increment-number-at-point)
(keymap-global-set "C-c -" #'ph/decrement-number-at-point)

(defun ph/macos-open (path)
  "Open `path' using the built-in `open' command from MacOS."
  (shell-command (concat "open " path)))

(set-face-attribute 'default nil
                    :font "Berkeley Mono"
                    ;; :font "BerkeleyMono Nerd Font Mono"
                    :height 130 ;; was 130 / 12 pt
                    :weight 'regular)

(set-face-attribute 'variable-pitch nil
                    :font "Cambria"
                    :height 120
                    :weight 'regular)

(set-face-attribute 'fixed-pitch nil
                    :font "Berkeley Mono"
                    ;; :font "BerkeleyMono Nerd Font Mono"
                    :height 130 ;; was 130
                    :weight 'regular)

(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)

(set-face-attribute 'font-lock-keyword-face nil
                    :slant 'normal)

;; (setq-default line-spacing 0.12)

(add-to-list 'custom-theme-load-path (concat user-emacs-directory "themes"))
(load-theme 'pmacs t)

(set-face-attribute
 'org-transclusion-fringe nil
 :foreground "#83be9d"
 ;; :background "#494a63"
 )

(set-face-attribute
 'org-transclusion-source-fringe nil
 :foreground "#83be9d"
 ;; :background "#494a63"
 )

(set-face-attribute
 'org-transclusion nil
 ;; :foreground "#83be9d"
 :background "#2d3c33"
 )

(set-face-attribute
 'org-transclusion-source nil
 ;; :foreground "#83be9d"
 :background "#2d3c33"
 )
